#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AlarmSpeaker

#include "Basic.hpp"


namespace SDK::Params
{

// Function AlarmSpeaker.AlarmSpeaker_C.ExecuteUbergraph_AlarmSpeaker
// 0x0008 (0x0008 - 0x0000)
struct AlarmSpeaker_C_ExecuteUbergraph_AlarmSpeaker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Activate;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AlarmSpeaker_C_ExecuteUbergraph_AlarmSpeaker;

// Function AlarmSpeaker.AlarmSpeaker_C.Set Alarm
// 0x0001 (0x0001 - 0x0000)
struct AlarmSpeaker_C_Set_Alarm final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AlarmSpeaker_C_Set_Alarm;

// Function AlarmSpeaker.AlarmSpeaker_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct AlarmSpeaker_C_UserConstructionScript final
{
public:
	class ASoundPath_C*                           K2Node_DynamicCast_AsSound_Path;                   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AlarmSpeaker_C_UserConstructionScript;

}

