#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WallText

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WallText.BP_WallText_C
// 0x0030 (0x02D8 - 0x02A8)
class ABP_WallText_C final : public AActor
{
public:
	class UTextRenderComponent*                   TextRender;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Text_Size;                                         // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x02C0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UMaterialInterface*                     Text_Material;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WallText_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WallText_C")
	}
	static class ABP_WallText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WallText_C>();
	}
};
DUMPER7_ASSERTS_ABP_WallText_C;

}

