#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Buff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_ConsumableType_structs.hpp"
#include "Str_ItemState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Buff.Buff_C
// 0x0030 (0x00D0 - 0x00A0)
class UBuff_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	E_ConsumableType                              Consumable_Type;                                   // 0x00A8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMec_C*                                 Mec_Ref;                                           // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x00B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Duration;                                          // 0x00C0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         State;                                             // 0x00C4(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Sort;                                              // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Add_Buff();
	void Armor_Trigger();
	void End_Armor();
	void End_Heal();
	void End_Sneack();
	void End_Speed();
	void ExecuteUbergraph_Buff(int32 EntryPoint);
	void Get_Same_Buff(class UBuff_C** Buff);
	void Heal_Tick();
	void Heal_Trigger();
	void ReceiveBeginPlay();
	void Request_Delete();
	void Seringe_Level(int32 New, int32* Result);
	void Set_Duration(int32 Duration_0, int32 clamp);
	void Sneak_Trigger();
	void Speed_Trigger();
	void Start_Timer();
	void Stop_Buff();
	void Tick();
	void Update_Armor(int32 New_Value);
	void Update_Heal(int32 New_Value);
	void Update_Sneak(int32 New_Value);
	void Update_Speed(int32 New_Value);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Buff_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Buff_C")
	}
	static class UBuff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuff_C>();
	}
};
DUMPER7_ASSERTS_UBuff_C;

}

