#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CR_Astronaut_HandsAim

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass CR_Astronaut_HandsAim.CR_Astronaut_HandsAim_C
// 0x0090 (0x0B60 - 0x0AD0)
class UCR_Astronaut_HandsAim_C final : public UControlRig
{
public:
	struct FVector                                Axis_Target;                                       // 0x0AD0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Main_Rotation;                                     // 0x0AE8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Main_Final_Rotation;                               // 0x0B00(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Main_Strength;                                     // 0x0B18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Main_Damping;                                      // 0x0B1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Hands_Rotation;                                    // 0x0B20(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Hands_Strength;                                    // 0x0B38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Hands_Damping;                                     // 0x0B3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Main_Intensity;                                    // 0x0B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Hands_Intensity;                                   // 0x0B48(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CR_Astronaut_HandsAim_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CR_Astronaut_HandsAim_C")
	}
	static class UCR_Astronaut_HandsAim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_Astronaut_HandsAim_C>();
	}
};
DUMPER7_ASSERTS_UCR_Astronaut_HandsAim_C;

}

