#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Data_SkinCustom_Head

#include "Basic.hpp"

#include "Str_MetalProperties_structs.hpp"
#include "Data_PlayerCustom_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Data_SkinCustom_Head.Data_SkinCustom_Head_C
// 0x0140 (0x0228 - 0x00E8)
class UData_SkinCustom_Head_C final : public UData_PlayerCustom_C
{
public:
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          Head_Model;                                        // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class UMaterialInstance*>   Head_Materials;                                    // 0x00F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FStr_MetalProperties> Metal_Materials;                                  // 0x0140(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FStr_MetalProperties                   Skin_Material;                                     // 0x0190(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class UTexture2D*>          Hair_Textures;                                     // 0x01A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UData_SkinCustom_Material_C*            Material_Hood;                                     // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UData_SkinCustom_Metal_C*               Material_Mask;                                     // 0x0200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UData_SkinCustom_Face_C*                Face;                                              // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UData_SkinCustom_EyeColor_C*            Eyes_Color;                                        // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UData_SkinCustom_HairColor_C*           Hair_Color;                                        // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Customizable_Face;                                 // 0x0220(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Customizable_Materials;                            // 0x0221(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Data_SkinCustom_Head_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Data_SkinCustom_Head_C")
	}
	static class UData_SkinCustom_Head_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UData_SkinCustom_Head_C>();
	}
};
DUMPER7_ASSERTS_UData_SkinCustom_Head_C;

}

