#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Data_SkinCustom_Body

#include "Basic.hpp"

#include "Str_MetalProperties_structs.hpp"
#include "Str_MaterialSwitch_structs.hpp"
#include "Data_PlayerCustom_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Data_SkinCustom_Body.Data_SkinCustom_Body_C
// 0x01B0 (0x0298 - 0x00E8)
class UData_SkinCustom_Body_C final : public UData_PlayerCustom_C
{
public:
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          Body_Model;                                        // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class UMaterialInstance*>   Body_Materials;                                    // 0x00F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FStr_MetalProperties> Metal_Materials;                                  // 0x0140(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FStr_MetalProperties> Light_Materials;                                  // 0x0190(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class UMaterialInstance*>   Static_Materials;                                  // 0x01E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FStr_MetalProperties                   Skin_Material;                                     // 0x0230(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStr_MaterialSwitch>            Special_Materials;                                 // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 Charm_Slot;                                        // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UData_SkinCustom_Material_C*            Material_1;                                        // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UData_SkinCustom_Material_C*            Material_2;                                        // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UData_SkinCustom_Material_C*            Material_3;                                        // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UData_SkinCustom_Material_C*            Material_Gloves;                                   // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UData_SkinCustom_Metal_C*               Metal;                                             // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Customizable_Matrials;                             // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Data_SkinCustom_Body_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Data_SkinCustom_Body_C")
	}
	static class UData_SkinCustom_Body_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UData_SkinCustom_Body_C>();
	}
};
DUMPER7_ASSERTS_UData_SkinCustom_Body_C;

}

