#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Data_SkinCustom_Face

#include "Basic.hpp"

#include "Data_PlayerCustom_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Data_SkinCustom_Face.Data_SkinCustom_Face_C
// 0x0030 (0x0118 - 0x00E8)
class UData_SkinCustom_Face_C final : public UData_PlayerCustom_C
{
public:
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Face_Texture;                                      // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Horizontal_Division;                               // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Min_Squint;                                        // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Squint;                                        // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Horizontal_Lock;                                   // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Vertical_Curve;                                    // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Data_SkinCustom_Face_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Data_SkinCustom_Face_C")
	}
	static class UData_SkinCustom_Face_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UData_SkinCustom_Face_C>();
	}
};
DUMPER7_ASSERTS_UData_SkinCustom_Face_C;

}

