#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Data_Skin_Element

#include "Basic.hpp"

#include "Enum_SkinElement_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Data_Skin_Element.Data_Skin_Element_C
// 0x01F0 (0x0220 - 0x0030)
class UData_Skin_Element_C : public UPrimaryDataAsset
{
public:
	class FString                                 Name_0;                                            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	Enum_SkinElement                              Type;                                              // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Image;                                             // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         DLC;                                               // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DLC_Link;                                          // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SkinColors;                                        // 0x006C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UData_Player_C*                         PlayerData;                                        // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRuntimeFloatCurve                     SaturationCurve;                                   // 0x0088(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRuntimeFloatCurve                     TeintCurve;                                        // 0x0110(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRuntimeFloatCurve                     LuminosityCurve;                                   // 0x0198(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SkinColor(const struct FVector2D& Skin, struct FLinearColor* Color);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Data_Skin_Element_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Data_Skin_Element_C")
	}
	static class UData_Skin_Element_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UData_Skin_Element_C>();
	}
};
DUMPER7_ASSERTS_UData_Skin_Element_C;

}

