#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DLC_Button

#include "Basic.hpp"


namespace SDK::Params
{

// Function DLC_Button.DLC_Button_C.ExecuteUbergraph_DLC_Button
// 0x0004 (0x0004 - 0x0000)
struct DLC_Button_C_ExecuteUbergraph_DLC_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DLC_Button_C_ExecuteUbergraph_DLC_Button;

// Function DLC_Button.DLC_Button_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct DLC_Button_C_UserConstructionScript final
{
public:
	class AButton_C*                              Button_0;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AButton_C*                              K2Node_DynamicCast_AsButton;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DLC_Button_C_UserConstructionScript;

}

