#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EditorRender

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "RenderTagRef_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass EditorRender.EditorRender_C
// 0x00A0 (0x0348 - 0x02A8)
class AEditorRender_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Lightmass;                                         // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialParameterCollection*           Ref;                                               // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 Mec_Ref;                                           // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ARenderZone_C*>                  RenderZones;                                       // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ARenderZone_C*                          Current_Zone;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ARenderZone_C*>                  in_Zones;                                          // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class FName, struct FRenderTagRef>       References;                                        // 0x02F8(0x0050)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_EditorRender(int32 EntryPoint);
	void Higher_Priority(class ARenderZone_C** Selected_Zone);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("EditorRender_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EditorRender_C")
	}
	static class AEditorRender_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEditorRender_C>();
	}
};
DUMPER7_ASSERTS_AEditorRender_C;

}

