#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct GamepadSettings.GamepadSettings
// 0x0050 (0x0050 - 0x0000)
struct FGamepadSettings final
{
public:
	double                                        Sensitivity_2_027C629548914D15344108B3689EA352;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraDeadzone_18_03AA9E344E609760745319B2529AA58C; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraLimit_19_8AB27FA148AE1E7BE703148880251F04;   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Linearity_10_F3D6852B4CB476DF0F0F62940FEE7ABD;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Boost_12_976C3A974C188F48EDDDDFBB30A378EC;         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InvertX_15_81FE04CF4F0C14BCF70A3D88BBFC46F2;       // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InvertY_17_DF3EAE1C4C4E5303EB67928EDB991ABA;       // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RunThreshold_22_76BB243E4B109AED1D7E0ABFBCAA081B;  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WalkThreshold_24_82B778214FCC26C93BE7BC802BF8545F; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VerticalRatio_27_B64D8F6648AC0872B4366C87196B98E7; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseGamepad_29_AB052A864B0E1F1AD11364A5DCE1EF42;    // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FGamepadSettings;

}

