#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Str_SpawnsArray_structs.hpp"
#include "E_Difficulty_structs.hpp"
#include "E_PlayerRole_structs.hpp"
#include "Str_ColorLink_structs.hpp"
#include "Enum_Sectors_structs.hpp"
#include "Enum_SelectedColor_structs.hpp"
#include "E_ColorsRepartition_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GM.GM_C
// 0x01F0 (0x0530 - 0x0340)
class AGM_C final : public AGameModeBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Ready_Timer_On;                                    // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AMec_C*>                         Players;                                           // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTimerHandle                           Start_Timer;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Start_Timer_Count;                                 // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          In_Game;                                           // 0x0374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATaskManager_C*                         Task_Screen;                                       // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AMec_C*>                         Innocents;                                         // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AMec_C*>                         Hackers;                                           // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         Game_Time;                                         // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TH_Game_Time;                                      // 0x03A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Game_Clear;                                        // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class APlayerSpawn_C*                         Start_Spawn;                                       // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Session_Time;                                      // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Should_TP;                                         // 0x03CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerSpawn_C*                         Lobby_Spawn;                                       // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Hackers_Count;                                     // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AMec_C*>                         New_Players;                                       // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AMec_C*>                         Quit_Players;                                      // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AActor*                                 Armed_C4_Ref;                                      // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Join_Update;                                       // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Cheat;                                             // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_NCS;                                           // 0x0419(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Weapons;                                       // 0x041A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B[0x5];                                      // 0x041B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Banned;                                            // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(bool Start)>    Tutorial_Change;                                   // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          In_Tutorial;                                       // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_BanList_C*                        Save_BanList;                                      // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              On_Ban;                                            // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	E_Difficulty                                  Difficulty;                                        // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ColorsRepartition                           ColorSelection;                                    // 0x0461(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_462[0x6];                                      // 0x0462(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStr_ColorLink>                 PlayerColorsApp;                                   // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, int32>                      Rules;                                             // 0x0478(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(class FName Rule)> Rule_Change;                                    // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Host_Force_Color;                                  // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<Enum_Sectors, struct FStr_SpawnsArray>   Spawns;                                            // 0x04E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Ban_Player(class AMec_C* Mec);
	void Check_Deaths(bool* All_Dead);
	void Check_Player_List(class AMec_C* New_Mec, int32* Index_0);
	void Check_Players_Ready(bool* Ready);
	void Check_Ready();
	void Death_in_Lobby();
	void Detonate_C4();
	void End_Game(bool Innocent_Win, bool Force);
	void End_on_Death();
	void ExecuteUbergraph_GM(int32 EntryPoint);
	void Game_Timer_Tick();
	void Get_Valid_Players(TArray<class AMec_C*>* Players_0);
	void K2_OnLogout(class AController* ExitingController);
	void K2_PostLogin(class APlayerController* NewPlayer);
	void Kick_All_Players();
	void New_Player(class AMec_C* Mec);
	void Quit_Player();
	void ReceiveBeginPlay();
	void Resize_Player_List();
	void Select_Game_Roles(int32 Saboters_Count);
	void Select_Join_Spawn(class AMec_C* Mec);
	void Select_Players_Colors();
	void Set_C4_Ref(class AActor* Armed_C4_Ref_0);
	void Set_HackerSphere(bool Clear);
	void Set_MapSpanwers();
	void Set_Tutorial_Mode(bool Start);
	void Start_Game();
	void Start_Game_Timer(int32 Time);
	void Start_Ready_Timer();
	void Start_Timer_Tick();
	void Start_Tutorial();
	void Stop_Game_Timer();
	void Stop_Ready_Timer();
	void Stop_Tutorial();
	void Switch_Player_Color(class AMec_C* Mec, Enum_SelectedColor Color, Enum_SelectedColor* Available_Color, class AMec_C** Owner_0, bool* Available);
	void Switch_Ready_ForPlayer(class AMec_C* Mec);
	void TP_Players_on_Lobby();
	void TP_Players_on_Start();
	void Update_Time();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GM_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GM_C")
	}
	static class AGM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGM_C>();
	}
};
DUMPER7_ASSERTS_AGM_C;

}

