#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Item_Spawner

#include "Basic.hpp"

#include "Str_ItemSpawnLocation_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Item_Spawner.Item_Spawner_C
// 0x0030 (0x02D8 - 0x02A8)
class AItem_Spawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder;                                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Used;                                              // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Zone;                                              // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 Location;                                          // 0x02D0(0x0002)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Clear_Used();
	void ExecuteUbergraph_Item_Spawner(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Spawn_Item(const struct FStr_Item& Item);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Item_Spawner_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Item_Spawner_C")
	}
	static class AItem_Spawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItem_Spawner_C>();
	}
};
DUMPER7_ASSERTS_AItem_Spawner_C;

}

