#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemSpawn_Handler

#include "Basic.hpp"

#include "Str_ItemSpawnLocation_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Enum_Sectors_structs.hpp"
#include "Str_ItemSpawnRef_structs.hpp"
#include "Str_ItemSpawnRequest_structs.hpp"
#include "Str_ItemPlacerRef_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ItemSpawn_Handler.ItemSpawn_Handler_C
// 0x00E0 (0x0388 - 0x02A8)
class AItemSpawn_Handler_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AItem_Spawner_C*>                All_Spawners;                                      // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<struct FStr_ItemSpawnLocation, struct FStr_ItemSpawnRef> SpawnersSectors;                   // 0x02C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FStr_ItemSpawnRequest>          Test_Spawners;                                     // 0x0318(0x0010)(Edit, BlueprintVisible)
	TArray<class AItem_Placer_C*>                 All_Placers;                                       // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<struct FStr_ItemSpawnLocation, struct FStr_ItemPlacerRef> PlacersSectors;                   // 0x0338(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ItemSpawn_Handler(int32 EntryPoint);
	void Place_Items();
	void ReceiveBeginPlay();
	void Search_Spawners();
	void Show_Placers();
	void Show_Spawners();
	void Spawn_Item(const struct FStr_Item& Item, TArray<struct FStr_ItemSpawnRequest>& Locations, struct FStr_ItemSpawnLocation* Location);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ItemSpawn_Handler_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemSpawn_Handler_C")
	}
	static class AItemSpawn_Handler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItemSpawn_Handler_C>();
	}
};
DUMPER7_ASSERTS_AItemSpawn_Handler_C;

}

