#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainGI

#include "Basic.hpp"

#include "OnlineSubsystemUtils_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_LoadMessage_structs.hpp"
#include "E_SessionVisilibity_structs.hpp"
#include "RuntimeDataTable_structs.hpp"
#include "NetCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MainGI.MainGI_C
// 0x0338 (0x04F8 - 0x01C0)
class UMainGI_C final : public UGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Intro_Sound;                                       // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           NewVar;                                            // 0x01D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UW_GI_HUD_C*                            HUD;                                               // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          First_Spawn;                                       // 0x01E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          In_Session;                                        // 0x01E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Project_Version;                                   // 0x01E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Debug_Editor;                                      // 0x01F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Ultimate_Admins;                                   // 0x0200(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Admin;                                             // 0x0210(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintSessionResult                Session_to_Join;                                   // 0x0218(0x0120)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Admin_Cheat;                                       // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Final_String;                                      // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Up_to_date;                                        // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              Update_Culture;                                    // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Update_All_Skins;                                  // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USave_BanList_C*                        Save_BanList;                                      // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Update_Banlist;                                    // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FBlueprintSessionResult                Invite_Result;                                     // 0x0390(0x0120)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 Input_Device_Name;                                 // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Output_Device_Name;                                // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	E_LoadMessage                                 ScreenMessage;                                     // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Host_Force_Color;                                  // 0x04D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2[0x2];                                      // 0x04D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Max_Player;                                        // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Cheat_Activation;                                  // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FString>                         Dev_banlist;                                       // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Add_to_Banlist(const class FString& SteamID);
	void Banlist_Datas(const struct FRuntimeDataTableCallbackInfo& CallbackInfo);
	void Check_Server_Datas();
	void Clean_Banlist();
	void Container_Add_Mesh(class UMeshComponent* Container);
	void Create_Session(const class FString& SessionName, const class FString& SessionPassword, E_SessionVisilibity Visibility);
	void Datas_Found(const struct FRuntimeDataTableCallbackInfo& CallbackInfo);
	void Destroy_Session(bool Force);
	void ExecuteUbergraph_MainGI(int32 EntryPoint);
	void Generate_FilesCode(TMap<class FString, int64>* Files, class FString* Code);
	void Get_Banlist(TArray<class FString>* Banlist);
	void Get_Dev_Banlist(TArray<class FString>* Banlist);
	void HandleNetworkError(ENetworkFailure FailureType, bool bIsServer);
	void HandleTravelError(ETravelFailure FailureType);
	void Invite_Accepted(bool bWasSuccessful, int32 LocalPlayerNum, const class FString& InvitedBy, const struct FBlueprintSessionResult& Session);
	void Join_Session(const struct FBlueprintSessionResult& Session);
	void OnCallback_53ADE5D94292283D8FA72FB38DFF9184();
	void OnFailure_321D833F47F49FB1E4BFB79F35CBFDD3();
	void OnFailure_4C9FFA1C4AB73436DE74C8826D52BB4E();
	void OnFailure_728662F4405B257744D5C795EE667A95(const class FString& JoinFailReason);
	void OnFailure_E11D28F341407BAAA92E07BF0B670CE0();
	void OnSuccess_321D833F47F49FB1E4BFB79F35CBFDD3();
	void OnSuccess_4C9FFA1C4AB73436DE74C8826D52BB4E();
	void OnSuccess_728662F4405B257744D5C795EE667A95(const class FString& JoinFailReason);
	void OnSuccess_E11D28F341407BAAA92E07BF0B670CE0();
	void Outpu_Device_name(const class FString& CurrentDevice);
	void Play_Sound(class USoundBase* Sound, float Volume, float Pitch);
	void ReceiveInit();
	void ReceiveShutdown();
	void Remove_from_Banlist(const class FString& SteamID, bool* Success);
	void Set_Language(const class FString& Culture);
	void Set_ScreenMessage(E_LoadMessage ScreenMessage_0);
	void Start_Screen();
	void Update_Dev_Banlist();
	void Update_Player_List();
	void Update_Session(const class FString& SessionName, int32 MaxPlayers);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MainGI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MainGI_C")
	}
	static class UMainGI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainGI_C>();
	}
};
DUMPER7_ASSERTS_UMainGI_C;

}

