#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanSDKRuntime

#include "Basic.hpp"

#include "MetaHumanSDKRuntime_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MetaHumanSDKRuntime.MetaHumanComponentBase
// 0x00F8 (0x0198 - 0x00A0)
class UMetaHumanComponentBase : public UActorComponent
{
public:
	class USkeletalMeshComponent*                 Body;                                              // 0x00A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 BodyComponentName;                                 // 0x00A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMetaHumanBodyType                            BodyType;                                          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableBodyCorrectives;                            // 0x00B9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Face;                                              // 0x00C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 FaceComponentName;                                 // 0x00C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         RigLogicLODThreshold;                              // 0x00D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableNeckCorrectives;                            // 0x00DC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NeckCorrectivesLODThreshold;                       // 0x00E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableNeckProcControlRig;                         // 0x00E4(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NeckProcControlRigLODThreshold;                    // 0x00E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaHumanCustomizableBodyPart         Torso;                                             // 0x00F0(0x0038)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FMetaHumanCustomizableBodyPart         Legs;                                              // 0x0128(0x0038)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FMetaHumanCustomizableBodyPart         Feet;                                              // 0x0160(0x0038)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MetaHumanComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MetaHumanComponentBase")
	}
	static class UMetaHumanComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanComponentBase>();
	}
};
DUMPER7_ASSERTS_UMetaHumanComponentBase;

// Class MetaHumanSDKRuntime.MetaHumanComponentUE
// 0x0028 (0x01C0 - 0x0198)
class UMetaHumanComponentUE final : public UMetaHumanComponentBase
{
public:
	TSoftClassPtr<class UClass>                   PostProcessAnimBP;                                 // 0x0198(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MetaHumanComponentUE")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MetaHumanComponentUE")
	}
	static class UMetaHumanComponentUE* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanComponentUE>();
	}
};
DUMPER7_ASSERTS_UMetaHumanComponentUE;

}

