#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RoomCamera

#include "Basic.hpp"


namespace SDK::Params
{

// Function RoomCamera.RoomCamera_C.ExecuteUbergraph_RoomCamera
// 0x0018 (0x0018 - 0x0000)
struct RoomCamera_C_ExecuteUbergraph_RoomCamera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 K2Node_CustomEvent_Texture;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RoomCamera_C_ExecuteUbergraph_RoomCamera;

// Function RoomCamera.RoomCamera_C.Set Texture
// 0x0008 (0x0008 - 0x0000)
struct RoomCamera_C_Set_Texture final
{
public:
	class UTextureRenderTarget2D*                 Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RoomCamera_C_Set_Texture;

}

