#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RuntimeDataTable

#include "Basic.hpp"

#include "RuntimeDataTable_structs.hpp"
#include "EasyCsv_structs.hpp"


namespace SDK::Params
{

// Function RuntimeDataTable.RuntimeDataTableWebToken.Init
// 0x0018 (0x0018 - 0x0000)
struct RuntimeDataTableWebToken_Init final
{
public:
	class FString                                 InTokenText;                                       // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SecondsUntilExpiration;                            // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeDataTableWebToken_Init;

// Function RuntimeDataTable.RuntimeDataTableWebToken.GetNumberOfSecondsUntilExpiration
// 0x0004 (0x0004 - 0x0000)
struct RuntimeDataTableWebToken_GetNumberOfSecondsUntilExpiration final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableWebToken_GetNumberOfSecondsUntilExpiration;

// Function RuntimeDataTable.RuntimeDataTableWebToken.GetTokenText
// 0x0010 (0x0010 - 0x0000)
struct RuntimeDataTableWebToken_GetTokenText final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableWebToken_GetTokenText;

// Function RuntimeDataTable.RuntimeDataTableWebToken.HasTokenExpired
// 0x0001 (0x0001 - 0x0000)
struct RuntimeDataTableWebToken_HasTokenExpired final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableWebToken_HasTokenExpired;

// Function RuntimeDataTable.RuntimeDataTableObject.AutoGenerateKeys
// 0x0010 (0x0010 - 0x0000)
struct RuntimeDataTableObject_AutoGenerateKeys final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableObject_AutoGenerateKeys;

// Function RuntimeDataTable.RuntimeDataTableObject.BuildGoogleSheetDownloadLinkAndGetAsCsv
// 0x0080 (0x0080 - 0x0000)
struct RuntimeDataTableObject_BuildGoogleSheetDownloadLinkAndGetAsCsv final
{
public:
	struct FRuntimeDataTableTokenInfo             InTokenInfo;                                       // 0x0000(0x0048)(ConstParm, Parm, NativeAccessSpecifierPublic)
	struct FRuntimeDataTableOperationParams       OperationParams;                                   // 0x0048(0x000C)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FRuntimeDataTableCallbackInfo& CallbackInfo)> CallOnComplete;        // 0x0054(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InSheetURL;                                        // 0x0068(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSheetIsPublic;                                    // 0x0078(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeDataTableObject_BuildGoogleSheetDownloadLinkAndGetAsCsv;

// Function RuntimeDataTable.RuntimeDataTableObject.GenerateCsvFromArray
// 0x0050 (0x0050 - 0x0000)
struct RuntimeDataTableObject_GenerateCsvFromArray final
{
public:
	TArray<int32>                                 ArrayToExport;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 OutCSV_String;                                     // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Keys;                                              // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 MembersToInclude;                                  // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSortColumnsAlphanumerically;                      // 0x0040(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UObject*                          OwningObject;                                      // 0x0048(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableObject_GenerateCsvFromArray;

// Function RuntimeDataTable.RuntimeDataTableObject.GenerateTokenInfoFromFile
// 0x0060 (0x0060 - 0x0000)
struct RuntimeDataTableObject_GenerateTokenInfoFromFile final
{
public:
	struct FRuntimeDataTableTokenInfo             OutTokenInfo;                                      // 0x0000(0x0048)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FString                                 InPathToFile;                                      // 0x0048(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DesiredSecondsUntilExpiration;                     // 0x0058(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x005C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeDataTableObject_GenerateTokenInfoFromFile;

// Function RuntimeDataTable.RuntimeDataTableObject.GenerateTokenInfoFromString
// 0x0060 (0x0060 - 0x0000)
struct RuntimeDataTableObject_GenerateTokenInfoFromString final
{
public:
	struct FRuntimeDataTableTokenInfo             OutTokenInfo;                                      // 0x0000(0x0048)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FString                                 InJsonString;                                      // 0x0048(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DesiredSecondsUntilExpiration;                     // 0x0058(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x005C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeDataTableObject_GenerateTokenInfoFromString;

// Function RuntimeDataTable.RuntimeDataTableObject.GetAllObjectPropertyNames
// 0x0030 (0x0030 - 0x0000)
struct RuntimeDataTableObject_GetAllObjectPropertyNames final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeOnlyConfigVariables;                       // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeInheritedVariables;                        // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MemberDenylist;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableObject_GetAllObjectPropertyNames;

// Function RuntimeDataTable.RuntimeDataTableObject.GetAllObjectVariableNames
// 0x0030 (0x0030 - 0x0000)
struct RuntimeDataTableObject_GetAllObjectVariableNames final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeOnlyConfigVariables;                       // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeInheritedVariables;                        // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MemberBlacklist;                                   // 0x0010(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableObject_GetAllObjectVariableNames;

// Function RuntimeDataTable.RuntimeDataTableObject.GetGoogleSheetsApiUrlPrefix
// 0x0010 (0x0010 - 0x0000)
struct RuntimeDataTableObject_GetGoogleSheetsApiUrlPrefix final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableObject_GetGoogleSheetsApiUrlPrefix;

// Function RuntimeDataTable.RuntimeDataTableObject.GetGoogleSheetsBatchUpdateURL
// 0x0020 (0x0020 - 0x0000)
struct RuntimeDataTableObject_GetGoogleSheetsBatchUpdateURL final
{
public:
	class FString                                 InSpreadsheetId;                                   // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableObject_GetGoogleSheetsBatchUpdateURL;

// Function RuntimeDataTable.RuntimeDataTableObject.GetGoogleSheetsUrlPrefix
// 0x0010 (0x0010 - 0x0000)
struct RuntimeDataTableObject_GetGoogleSheetsUrlPrefix final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableObject_GetGoogleSheetsUrlPrefix;

// Function RuntimeDataTable.RuntimeDataTableObject.GetGoogleSheetsValuesBatchUpdateURL
// 0x0020 (0x0020 - 0x0000)
struct RuntimeDataTableObject_GetGoogleSheetsValuesBatchUpdateURL final
{
public:
	class FString                                 InSpreadsheetId;                                   // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableObject_GetGoogleSheetsValuesBatchUpdateURL;

// Function RuntimeDataTable.RuntimeDataTableObject.GetMimeCsv
// 0x0010 (0x0010 - 0x0000)
struct RuntimeDataTableObject_GetMimeCsv final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableObject_GetMimeCsv;

// Function RuntimeDataTable.RuntimeDataTableObject.GetSheetIdFromUrl
// 0x0020 (0x0020 - 0x0000)
struct RuntimeDataTableObject_GetSheetIdFromUrl final
{
public:
	class FString                                 SheetURL;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableObject_GetSheetIdFromUrl;

// Function RuntimeDataTable.RuntimeDataTableObject.GetSheetIdFromUrl_Int
// 0x0018 (0x0018 - 0x0000)
struct RuntimeDataTableObject_GetSheetIdFromUrl_Int final
{
public:
	class FString                                 SheetURL;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeDataTableObject_GetSheetIdFromUrl_Int;

// Function RuntimeDataTable.RuntimeDataTableObject.GetSpreadsheetIdFromUrl
// 0x0020 (0x0020 - 0x0000)
struct RuntimeDataTableObject_GetSpreadsheetIdFromUrl final
{
public:
	class FString                                 SheetURL;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableObject_GetSpreadsheetIdFromUrl;

// Function RuntimeDataTable.RuntimeDataTableObject.UpdateArrayFromCsvInfo
// 0x0098 (0x0098 - 0x0000)
struct RuntimeDataTableObject_UpdateArrayFromCsvInfo final
{
public:
	TArray<int32>                                 ArrayToUpdate;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          Successful;                                        // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEasyCsvInfo                           CSVInfo;                                           // 0x0018(0x0070)(Parm, NativeAccessSpecifierPublic)
	bool                                          MatchStructMemberNames;                            // 0x0088(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UObject*                          OwningObject;                                      // 0x0090(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableObject_UpdateArrayFromCsvInfo;

// Function RuntimeDataTable.RuntimeDataTableObject.ValidateGoogleSheetsDownloadAndLoadBackupIfNeeded
// 0x00C8 (0x00C8 - 0x0000)
struct RuntimeDataTableObject_ValidateGoogleSheetsDownloadAndLoadBackupIfNeeded final
{
public:
	struct FRuntimeDataTableCallbackInfo          InCallbackInfo;                                    // 0x0000(0x0028)(ConstParm, Parm, NativeAccessSpecifierPublic)
	struct FEasyCsvInfo                           OutCsvInfo;                                        // 0x0028(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
	ERuntimeDataTableBackupResultCode             OutResultCode;                                     // 0x0098(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BackupSavePath;                                    // 0x00A0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackupLoadPath;                                    // 0x00B0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeDataTableObject_ValidateGoogleSheetsDownloadAndLoadBackupIfNeeded;

// Function RuntimeDataTable.RuntimeDataTableObject.WriteCsvToSheet
// 0x0090 (0x0090 - 0x0000)
struct RuntimeDataTableObject_WriteCsvToSheet final
{
public:
	struct FRuntimeDataTableTokenInfo             InTokenInfo;                                       // 0x0000(0x0048)(Parm, NativeAccessSpecifierPublic)
	struct FRuntimeDataTableOperationParams       OperationParams;                                   // 0x0048(0x000C)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FRuntimeDataTableCallbackInfo& CallbackInfo)> CallOnComplete;        // 0x0054(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InSpreadsheetId;                                   // 0x0068(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InSheetId;                                         // 0x0078(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InCsv;                                             // 0x0080(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeDataTableObject_WriteCsvToSheet;

}

