#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RuntimeDataTable

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "EasyCsv_structs.hpp"
#include "RuntimeDataTable_structs.hpp"


namespace SDK
{

// Class RuntimeDataTable.RuntimeDataTableWebToken
// 0x0020 (0x0048 - 0x0028)
class URuntimeDataTableWebToken final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool Init(const class FString& InTokenText, const int32 SecondsUntilExpiration);

	int32 GetNumberOfSecondsUntilExpiration() const;
	class FString GetTokenText() const;
	bool HasTokenExpired() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RuntimeDataTableWebToken")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RuntimeDataTableWebToken")
	}
	static class URuntimeDataTableWebToken* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeDataTableWebToken>();
	}
};
DUMPER7_ASSERTS_URuntimeDataTableWebToken;

// Class RuntimeDataTable.RuntimeDataTableObject
// 0x0070 (0x0098 - 0x0028)
class URuntimeDataTableObject final : public UObject
{
public:
	struct FEasyCsvInfo                           CachedCsvInfo;                                     // 0x0028(0x0070)(BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static TArray<class FName> AutoGenerateKeys();
	static void BuildGoogleSheetDownloadLinkAndGetAsCsv(const struct FRuntimeDataTableTokenInfo& InTokenInfo, const struct FRuntimeDataTableOperationParams& OperationParams, const TDelegate<void(const struct FRuntimeDataTableCallbackInfo& CallbackInfo)> CallOnComplete, const class FString& InSheetURL, const bool bSheetIsPublic);
	static void GenerateCsvFromArray(const TArray<int32>& ArrayToExport, class FString* OutCSV_String, const TArray<class FName>& Keys, const class FString& MembersToInclude, const bool bSortColumnsAlphanumerically, const class UObject* OwningObject);
	static bool GenerateTokenInfoFromFile(struct FRuntimeDataTableTokenInfo* OutTokenInfo, const class FString& InPathToFile, const int32 DesiredSecondsUntilExpiration);
	static bool GenerateTokenInfoFromString(struct FRuntimeDataTableTokenInfo* OutTokenInfo, const class FString& InJsonString, const int32 DesiredSecondsUntilExpiration);
	static class FString GetAllObjectPropertyNames(const class UObject* Object, const bool bIncludeOnlyConfigVariables, const bool bIncludeInheritedVariables, const class FString& MemberDenylist);
	static class FString GetAllObjectVariableNames(const class UObject* Object, const bool bIncludeOnlyConfigVariables, const bool bIncludeInheritedVariables, const class FString& MemberBlacklist);
	static class FString GetGoogleSheetsApiUrlPrefix();
	static class FString GetGoogleSheetsBatchUpdateURL(const class FString& InSpreadsheetId);
	static class FString GetGoogleSheetsUrlPrefix();
	static class FString GetGoogleSheetsValuesBatchUpdateURL(const class FString& InSpreadsheetId);
	static class FString GetMimeCsv();
	static class FString GetSheetIdFromUrl(const class FString& SheetURL);
	static int32 GetSheetIdFromUrl_Int(const class FString& SheetURL);
	static class FString GetSpreadsheetIdFromUrl(const class FString& SheetURL);
	static void UpdateArrayFromCsvInfo(const TArray<int32>& ArrayToUpdate, bool* Successful, const struct FEasyCsvInfo& CSVInfo, bool MatchStructMemberNames, const class UObject* OwningObject);
	static bool ValidateGoogleSheetsDownloadAndLoadBackupIfNeeded(const struct FRuntimeDataTableCallbackInfo& InCallbackInfo, struct FEasyCsvInfo* OutCsvInfo, ERuntimeDataTableBackupResultCode* OutResultCode, const class FString& BackupSavePath, const class FString& BackupLoadPath);
	static void WriteCsvToSheet(const struct FRuntimeDataTableTokenInfo& InTokenInfo, const struct FRuntimeDataTableOperationParams& OperationParams, const TDelegate<void(const struct FRuntimeDataTableCallbackInfo& CallbackInfo)>& CallOnComplete, const class FString& InSpreadsheetId, const int32 InSheetId, const class FString& InCsv);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RuntimeDataTableObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RuntimeDataTableObject")
	}
	static class URuntimeDataTableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeDataTableObject>();
	}
};
DUMPER7_ASSERTS_URuntimeDataTableObject;

// Class RuntimeDataTable.RuntimeDataTableProjectSettings
// 0x0070 (0x0098 - 0x0028)
class URuntimeDataTableProjectSettings final : public UObject
{
public:
	int32                                         LogCharacterLimit;                                 // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintDisplayMessagesToLog;                        // 0x002C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintDisplayMessagesToScreen;                     // 0x002D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DisplayMessagesOnScreenLifetime;                   // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintWarningMessagesToLog;                        // 0x0034(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintWarningMessagesToScreen;                     // 0x0035(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WarningMessagesOnScreenLifetime;                   // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintErrorMessagesToLog;                          // 0x003C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintErrorMessagesToScreen;                       // 0x003D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ErrorMessagesOnScreenLifetime;                     // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GoogleSheetsUrlPrefix;                             // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GoogleSheetsApiUrlPrefix;                          // 0x0058(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GoogleSheetsBatchUpdateCommand;                    // 0x0068(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GoogleSheetsValuesBatchUpdateCommand;              // 0x0078(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GoogleSheetsMimeCsv;                               // 0x0088(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RuntimeDataTableProjectSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RuntimeDataTableProjectSettings")
	}
	static class URuntimeDataTableProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeDataTableProjectSettings>();
	}
};
DUMPER7_ASSERTS_URuntimeDataTableProjectSettings;

}

