#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SteamAudio

#include "Basic.hpp"

#include "SteamAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "AudioExtensions_classes.hpp"


namespace SDK
{

// Class SteamAudio.SOFAFile
// 0x0028 (0x0050 - 0x0028)
class USOFAFile final : public UObject
{
public:
	class FString                                 Name_0;                                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Data;                                              // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         Volume;                                            // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHRTFNormType                                 NormalizationType;                                 // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SOFAFile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SOFAFile")
	}
	static class USOFAFile* GetDefaultObj()
	{
		return GetDefaultObjImpl<USOFAFile>();
	}
};
DUMPER7_ASSERTS_USOFAFile;

// Class SteamAudio.SteamAudioBakedListenerComponent
// 0x0008 (0x00A8 - 0x00A0)
class USteamAudioBakedListenerComponent final : public UActorComponent
{
public:
	float                                         InfluenceRadius;                                   // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioBakedListenerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioBakedListenerComponent")
	}
	static class USteamAudioBakedListenerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamAudioBakedListenerComponent>();
	}
};
DUMPER7_ASSERTS_USteamAudioBakedListenerComponent;

// Class SteamAudio.SteamAudioBakedSourceComponent
// 0x0008 (0x00A8 - 0x00A0)
class USteamAudioBakedSourceComponent final : public UActorComponent
{
public:
	float                                         InfluenceRadius;                                   // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioBakedSourceComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioBakedSourceComponent")
	}
	static class USteamAudioBakedSourceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamAudioBakedSourceComponent>();
	}
};
DUMPER7_ASSERTS_USteamAudioBakedSourceComponent;

// Class SteamAudio.SteamAudioDynamicObjectComponent
// 0x0030 (0x00D0 - 0x00A0)
class USteamAudioDynamicObjectComponent final : public UActorComponent
{
public:
	struct FSoftObjectPath                        Asset;                                             // 0x00A0(0x0020)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x10];                                      // 0x00C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioDynamicObjectComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioDynamicObjectComponent")
	}
	static class USteamAudioDynamicObjectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamAudioDynamicObjectComponent>();
	}
};
DUMPER7_ASSERTS_USteamAudioDynamicObjectComponent;

// Class SteamAudio.SteamAudioGeometryComponent
// 0x0030 (0x00D0 - 0x00A0)
class USteamAudioGeometryComponent final : public UActorComponent
{
public:
	struct FSoftObjectPath                        Material;                                          // 0x00A0(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExportAllChildren;                                // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumVertices;                                       // 0x00C4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumTriangles;                                      // 0x00C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioGeometryComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioGeometryComponent")
	}
	static class USteamAudioGeometryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamAudioGeometryComponent>();
	}
};
DUMPER7_ASSERTS_USteamAudioGeometryComponent;

// Class SteamAudio.SteamAudioListenerComponent
// 0x0048 (0x00E8 - 0x00A0)
class USteamAudioListenerComponent final : public UActorComponent
{
public:
	TSoftObjectPtr<class AActor>                  CurrentBakedListener;                              // 0x00A0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimulateReverb;                                   // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EReverbSimulationType                         ReverbType;                                        // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x1E];                                      // 0x00CA(0x001E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioListenerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioListenerComponent")
	}
	static class USteamAudioListenerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamAudioListenerComponent>();
	}
};
DUMPER7_ASSERTS_USteamAudioListenerComponent;

// Class SteamAudio.SteamAudioMaterial
// 0x0020 (0x0048 - 0x0028)
class USteamAudioMaterial final : public UObject
{
public:
	float                                         AbsorptionLow;                                     // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AbsorptionMid;                                     // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AbsorptionHigh;                                    // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scattering;                                        // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransmissionLow;                                   // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransmissionMid;                                   // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransmissionHigh;                                  // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioMaterial")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioMaterial")
	}
	static class USteamAudioMaterial* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamAudioMaterial>();
	}
};
DUMPER7_ASSERTS_USteamAudioMaterial;

// Class SteamAudio.SteamAudioOcclusionSettings
// 0x0010 (0x0038 - 0x0028)
class USteamAudioOcclusionSettings final : public UOcclusionPluginSourceSettingsBase
{
public:
	bool                                          bApplyDistanceAttenuation;                         // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyAirAbsorption;                               // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyDirectivity;                                 // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DipoleWeight;                                      // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DipolePower;                                       // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyOcclusion;                                   // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyTransmission;                                // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETransmissionType                             TransmissionType;                                  // 0x0036(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioOcclusionSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioOcclusionSettings")
	}
	static class USteamAudioOcclusionSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamAudioOcclusionSettings>();
	}
};
DUMPER7_ASSERTS_USteamAudioOcclusionSettings;

// Class SteamAudio.SteamAudioProbeComponent
// 0x0038 (0x00D8 - 0x00A0)
class USteamAudioProbeComponent final : public UActorComponent
{
public:
	TArray<struct FVector>                        ProbePositions;                                    // 0x00A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x28];                                      // 0x00B0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioProbeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioProbeComponent")
	}
	static class USteamAudioProbeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamAudioProbeComponent>();
	}
};
DUMPER7_ASSERTS_USteamAudioProbeComponent;

// Class SteamAudio.SteamAudioProbeVolume
// 0x0060 (0x0340 - 0x02E0)
class ASteamAudioProbeVolume final : public AVolume
{
public:
	struct FSoftObjectPath                        Asset;                                             // 0x02E0(0x0020)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProbeGenerationType                          GenerationType;                                    // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HorizontalSpacing;                                 // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightAboveFloor;                                  // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumProbes;                                         // 0x030C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DataSize;                                          // 0x0310(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamAudioBakedDataInfo>       DetailedStats;                                     // 0x0318(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class USteamAudioProbeComponent*              ProbeComponent;                                    // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_330[0x10];                                     // 0x0330(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioProbeVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioProbeVolume")
	}
	static class ASteamAudioProbeVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASteamAudioProbeVolume>();
	}
};
DUMPER7_ASSERTS_ASteamAudioProbeVolume;

// Class SteamAudio.SteamAudioReverbSubmixPluginPreset
// 0x0030 (0x0098 - 0x0068)
class USteamAudioReverbSubmixPluginPreset final : public USoundEffectSubmixPreset
{
public:
	uint8                                         Pad_68[0x2A];                                      // 0x0068(0x002A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamAudioReverbSubmixPluginSettings  Settings;                                          // 0x0092(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioReverbSubmixPluginPreset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioReverbSubmixPluginPreset")
	}
	static class USteamAudioReverbSubmixPluginPreset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamAudioReverbSubmixPluginPreset>();
	}
};
DUMPER7_ASSERTS_USteamAudioReverbSubmixPluginPreset;

// Class SteamAudio.SteamAudioReverbSettings
// 0x0008 (0x0030 - 0x0028)
class USteamAudioReverbSettings final : public UReverbPluginSourceSettingsBase
{
public:
	bool                                          bApplyReflections;                                 // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyHRTFToReflections;                           // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReflectionsMixLevel;                               // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioReverbSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioReverbSettings")
	}
	static class USteamAudioReverbSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamAudioReverbSettings>();
	}
};
DUMPER7_ASSERTS_USteamAudioReverbSettings;

// Class SteamAudio.SteamAudioSerializedObject
// 0x0010 (0x0038 - 0x0028)
class USteamAudioSerializedObject final : public UObject
{
public:
	TArray<uint8>                                 Data;                                              // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioSerializedObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioSerializedObject")
	}
	static class USteamAudioSerializedObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamAudioSerializedObject>();
	}
};
DUMPER7_ASSERTS_USteamAudioSerializedObject;

// Class SteamAudio.SteamAudioSettings
// 0x0140 (0x0168 - 0x0028)
class USteamAudioSettings final : public UObject
{
public:
	EAudioEngineType                              AudioEngine;                                       // 0x0028(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExportLandscapeGeometry;                          // 0x0029(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExportBSPGeometry;                                // 0x002A(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        DefaultMeshMaterial;                               // 0x0030(0x0020)(Edit, ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DefaultLandscapeMaterial;                          // 0x0050(0x0020)(Edit, ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DefaultBSPMaterial;                                // 0x0070(0x0020)(Edit, ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESceneType                                    SceneType;                                         // 0x0090(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxOcclusionSamples;                               // 0x0094(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RealTimeRays;                                      // 0x0098(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RealTimeBounces;                                   // 0x009C(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RealTimeDuration;                                  // 0x00A0(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RealTimeAmbisonicOrder;                            // 0x00A4(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RealTimeMaxSources;                                // 0x00A8(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RealTimeCPUCoresPercentage;                        // 0x00AC(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RealTimeIrradianceMinDistance;                     // 0x00B0(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBakeConvolution;                                  // 0x00B4(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBakeParametric;                                   // 0x00B5(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BakingRays;                                        // 0x00B8(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BakingBounces;                                     // 0x00BC(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BakingDuration;                                    // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BakingAmbisonicOrder;                              // 0x00C4(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BakingCPUCoresPercentage;                          // 0x00C8(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BakingIrradianceMinDistance;                       // 0x00CC(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReverbSubmix;                                      // 0x00D0(0x0020)(Edit, ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BakingVisibilitySamples;                           // 0x00F0(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BakingVisibilityRadius;                            // 0x00F4(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BakingVisibilityThreshold;                         // 0x00F8(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BakingVisibilityRange;                             // 0x00FC(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BakingPathRange;                                   // 0x0100(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BakedPathingCPUCoresPercentage;                    // 0x0104(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SimulationUpdateInterval;                          // 0x0108(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EReflectionEffectType                         ReflectionEffectType;                              // 0x010C(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HybridReverbTransitionTime;                        // 0x0110(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HybridReverbOverlapPercent;                        // 0x0114(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOpenCLDeviceType                             DeviceType;                                        // 0x0118(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxReservedComputeUnits;                           // 0x011C(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FractionComputeUnitsForIRUpdate;                   // 0x0120(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BakingBatchSize;                                   // 0x0124(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TANDuration;                                       // 0x0128(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TANAmbisonicOrder;                                 // 0x012C(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TANMaxSources;                                     // 0x0130(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HRTFVolume;                                        // 0x0134(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHRTFNormType                                 HRTFNormalizationType;                             // 0x0138(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        SOFAFile;                                          // 0x0140(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableValidation;                                  // 0x0160(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioSettings")
	}
	static class USteamAudioSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamAudioSettings>();
	}
};
DUMPER7_ASSERTS_USteamAudioSettings;

// Class SteamAudio.SteamAudioSourceComponent
// 0x0088 (0x0128 - 0x00A0)
class USteamAudioSourceComponent final : public UActorComponent
{
public:
	bool                                          bSimulateOcclusion;                                // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOcclusionType                                OcclusionType;                                     // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OcclusionRadius;                                   // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OcclusionSamples;                                  // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OcclusionValue;                                    // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimulateTransmission;                             // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TransmissionLowValue;                              // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransmissionMidValue;                              // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransmissionHighValue;                             // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxTransmissionSurfaces;                           // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimulateReflections;                              // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EReflectionSimulationType                     ReflectionsType;                                   // 0x00C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CurrentBakedSource;                                // 0x00C8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimulatePathing;                                  // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASteamAudioProbeVolume*                 PathingProbeBatch;                                 // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPathValidation;                                   // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFindAlternatePaths;                               // 0x0101(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_102[0x26];                                     // 0x0102(0x0026)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioSourceComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioSourceComponent")
	}
	static class USteamAudioSourceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamAudioSourceComponent>();
	}
};
DUMPER7_ASSERTS_USteamAudioSourceComponent;

// Class SteamAudio.SteamAudioSpatializationSettings
// 0x0008 (0x0030 - 0x0028)
class USteamAudioSpatializationSettings final : public USpatializationPluginSourceSettingsBase
{
public:
	bool                                          bBinaural;                                         // 0x0028(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHRTFInterpolation                            Interpolation;                                     // 0x0029(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyPathing;                                     // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyHRTFToPathing;                               // 0x002B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PathingMixLevel;                                   // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioSpatializationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioSpatializationSettings")
	}
	static class USteamAudioSpatializationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamAudioSpatializationSettings>();
	}
};
DUMPER7_ASSERTS_USteamAudioSpatializationSettings;

// Class SteamAudio.SteamAudioStaticMeshActor
// 0x0030 (0x02D8 - 0x02A8)
class ASteamAudioStaticMeshActor final : public AActor
{
public:
	struct FSoftObjectPath                        Asset;                                             // 0x02A8(0x0020)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C8[0x10];                                     // 0x02C8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamAudioStaticMeshActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamAudioStaticMeshActor")
	}
	static class ASteamAudioStaticMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASteamAudioStaticMeshActor>();
	}
};
DUMPER7_ASSERTS_ASteamAudioStaticMeshActor;

}

