#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Str_TutorialRoom

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Str_TutorialRoom.Str_TutorialRoom
// 0x0030 (0x0030 - 0x0000)
struct FStr_TutorialRoom final
{
public:
	int32                                         Room_14_7683DC1A463A5B8B7B3F2D89E2E6A350;          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATuto_Check_C*>                  Checks_12_442E5F094B824E3069BD9EB1512F7651;        // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ATuto_Door_C*                           Door_8_25655D3E4CD0676CBAB9ECBCF6C5772C;           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class ATuto_ItemSpawn_C*>              Spawners_13_7B8D59AB42ABDF3B72686EA2247737D6;      // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
};
DUMPER7_ASSERTS_FStr_TutorialRoom;

}

