#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Str_gamerule

#include "Basic.hpp"

#include "E_RuleType_structs.hpp"


namespace SDK
{

// UserDefinedStruct Str_gamerule.Str_gamerule
// 0x0058 (0x0058 - 0x0000)
struct FStr_gamerule final
{
public:
	class FText                                   Name_2_A2A9ACBC407207101B1AAD9D0A17CB21;           // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Easy_31_B6FCFAAE4F9892D5A2C4359152C7D491;          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Default_5_89F02CF041FD8A231332938A1163B83C;        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Min_10_A4D39E944B7E76172A6AF3A3026F475F;           // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max_11_D5213B8C473A680977BDAA9E69A18D42;           // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ValueMax_34_CAF2ABD64B988BB5E8D9A6A93B163E0D;      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           Selections_17_F59AA601444CE070FDEEA6995683B254;    // 0x0028(0x0010)(Edit, BlueprintVisible)
	E_RuleType                                    Type_21_026CF5074998356A42D589AE6A89ECBF;          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Tag_25_D7E0D70D454A686F57B551BBCC7D698A;           // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          TriggerChange_28_F651CD9A4F14D952B484AB8EEA70AAF7; // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStr_gamerule;

}

