#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Str_SkinSet

#include "Basic.hpp"

#include "Enum_SelectedColor_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Str_SkinSet.Str_SkinSet
// 0x0050 (0x0050 - 0x0000)
struct FStr_SkinSet final
{
public:
	Enum_SelectedColor                            Color_8_10233C2342639ABAB83BF39047D25F64;          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UData_Skin_Body_C*                      Body_9_7CCCDA5742FC3FF96CB1F29538AF21CE;           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UData_Skin_Head_C*                      Head_10_47E8AE4E42403C1D46C62FBCFA5D3559;          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UData_Face_C*                           Face_11_58F6737E461EB2AE611317BBBE221A20;          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Skin_27_B3C8B53C44F292766F254E84D75595B7;          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UData_Skin_Ghost_C*                     Ghost_14_5A34D091419044583216C681F53B2E9F;         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UData_Skin_Patch_C*                     PatchRound_21_295D26764B5AD99AABD1619CB5FDD3DF;    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UData_Skin_Patch_C*                     PatchSquare_23_A04787EB496462C53541E5912E58D466;   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UData_Skin_Charm_C*                     Charm_26_2B83F8AD48250E19A0C12CBB4FA4D911;         // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStr_SkinSet;

}

