#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SyncBoard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SyncBoard.SyncBoard_C
// 0x0038 (0x02E0 - 0x02A8)
class ASyncBoard_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 Board_Text;                                        // 0x02C0(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, RepNotify, HasGetValueTypeHash)
	class UW_SyncBoard_C*                         Board_Widget;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  GM_Ref;                                            // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Correct_Text(const class FString& String, class FString* Result);
	void ExecuteUbergraph_SyncBoard(int32 EntryPoint);
	void OnRep_Board_Text();
	void ReceiveBeginPlay();
	void Sheet_Result(const struct FRuntimeDataTableCallbackInfo& CallbackInfo);
	void Update_Board();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SyncBoard_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SyncBoard_C")
	}
	static class ASyncBoard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASyncBoard_C>();
	}
};
DUMPER7_ASSERTS_ASyncBoard_C;

}

