#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SystemMicControlLite

#include "Basic.hpp"


namespace SDK::Params
{

// Function SystemMicControlLite.SystemMicControlLiteBPLibrary.GetMicActiveDevices
// 0x0050 (0x0050 - 0x0000)
struct SystemMicControlLiteBPLibrary_GetMicActiveDevices final
{
public:
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SystemMicControlLiteBPLibrary_GetMicActiveDevices;

// Function SystemMicControlLite.SystemMicControlLiteBPLibrary.GetMicDefaultDeviceId
// 0x0010 (0x0010 - 0x0000)
struct SystemMicControlLiteBPLibrary_GetMicDefaultDeviceId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SystemMicControlLiteBPLibrary_GetMicDefaultDeviceId;

// Function SystemMicControlLite.SystemMicControlLiteBPLibrary.GetMicDefaultDeviceName
// 0x0010 (0x0010 - 0x0000)
struct SystemMicControlLiteBPLibrary_GetMicDefaultDeviceName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SystemMicControlLiteBPLibrary_GetMicDefaultDeviceName;

// Function SystemMicControlLite.SystemMicControlLiteBPLibrary.GetMicDeviceIdFromName
// 0x0020 (0x0020 - 0x0000)
struct SystemMicControlLiteBPLibrary_GetMicDeviceIdFromName final
{
public:
	class FString                                 InDeviceName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutDeviceId;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SystemMicControlLiteBPLibrary_GetMicDeviceIdFromName;

// Function SystemMicControlLite.SystemMicControlLiteBPLibrary.GetMicDeviceNameFromId
// 0x0020 (0x0020 - 0x0000)
struct SystemMicControlLiteBPLibrary_GetMicDeviceNameFromId final
{
public:
	class FString                                 InDeviceId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutDeviceName;                                     // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SystemMicControlLiteBPLibrary_GetMicDeviceNameFromId;

// Function SystemMicControlLite.SystemMicControlLiteBPLibrary.GetMicVolume
// 0x0004 (0x0004 - 0x0000)
struct SystemMicControlLiteBPLibrary_GetMicVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SystemMicControlLiteBPLibrary_GetMicVolume;

// Function SystemMicControlLite.SystemMicControlLiteBPLibrary.GetMicVolumeForDeviceId
// 0x0018 (0x0018 - 0x0000)
struct SystemMicControlLiteBPLibrary_GetMicVolumeForDeviceId final
{
public:
	class FString                                 InDeviceId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutVolume;                                         // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SystemMicControlLiteBPLibrary_GetMicVolumeForDeviceId;

// Function SystemMicControlLite.SystemMicControlLiteBPLibrary.GetMicVolumeForDeviceName
// 0x0018 (0x0018 - 0x0000)
struct SystemMicControlLiteBPLibrary_GetMicVolumeForDeviceName final
{
public:
	class FString                                 InDeviceName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutVolume;                                         // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SystemMicControlLiteBPLibrary_GetMicVolumeForDeviceName;

// Function SystemMicControlLite.SystemMicControlLiteBPLibrary.SetMicVolume
// 0x0004 (0x0004 - 0x0000)
struct SystemMicControlLiteBPLibrary_SetMicVolume final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SystemMicControlLiteBPLibrary_SetMicVolume;

// Function SystemMicControlLite.SystemMicControlLiteBPLibrary.SetMicVolumeForDeviceId
// 0x0018 (0x0018 - 0x0000)
struct SystemMicControlLiteBPLibrary_SetMicVolumeForDeviceId final
{
public:
	class FString                                 DeviceID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SystemMicControlLiteBPLibrary_SetMicVolumeForDeviceId;

// Function SystemMicControlLite.SystemMicControlLiteBPLibrary.SetMicVolumeForDeviceName
// 0x0018 (0x0018 - 0x0000)
struct SystemMicControlLiteBPLibrary_SetMicVolumeForDeviceName final
{
public:
	class FString                                 DeviceName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SystemMicControlLiteBPLibrary_SetMicVolumeForDeviceName;

}

