#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tablet

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Tablet.Tablet_C.ExecuteUbergraph_Tablet
// 0x0058 (0x0058 - 0x0000)
struct Tablet_C_ExecuteUbergraph_Tablet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Tablet_UI_C*                         K2Node_DynamicCast_AsW_Tablet_UI;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_CustomEvent_Movement;                       // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_CustomEvent_Mec_Ref;                        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Lock;                           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATask_C*>                        K2Node_CustomEvent_Tasks;                          // 0x0040(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_CustomEvent_Video;                          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Tablet_C_ExecuteUbergraph_Tablet;

// Function Tablet.Tablet_C.Initiate
// 0x0008 (0x0008 - 0x0000)
struct Tablet_C_Initiate final
{
public:
	class AMec_C*                                 Mec_Ref_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Tablet_C_Initiate;

// Function Tablet.Tablet_C.Lock Mouse
// 0x0001 (0x0001 - 0x0000)
struct Tablet_C_Lock_Mouse final
{
public:
	bool                                          Lock;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Tablet_C_Lock_Mouse;

// Function Tablet.Tablet_C.Move
// 0x0010 (0x0010 - 0x0000)
struct Tablet_C_Move final
{
public:
	struct FVector2D                              Movement;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Tablet_C_Move;

// Function Tablet.Tablet_C.Set Screen Shader
// 0x0001 (0x0001 - 0x0000)
struct Tablet_C_Set_Screen_Shader final
{
public:
	bool                                          Video;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Tablet_C_Set_Screen_Shader;

// Function Tablet.Tablet_C.Update Tasks
// 0x0010 (0x0010 - 0x0000)
struct Tablet_C_Update_Tasks final
{
public:
	TArray<class ATask_C*>                        Tasks;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_Tablet_C_Update_Tasks;

}

