#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_DelivryIn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_Sectors_structs.hpp"
#include "Task_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Task_DelivryIn.Task_DelivryIn_C
// 0x0040 (0x03B0 - 0x0370)
class ATask_DelivryIn_C final : public ATask_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Task_DelivryIn_C;                   // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class ADeliveryCase_C*>                Cases;                                             // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ADeliveryCase_C*>                Task_Cases;                                        // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         Packages_Count;                                    // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max_Packages;                                      // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<Enum_Sectors>                          Sectors_List;                                      // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Check_Cases(bool* Finished, int32* Count);
	void Check_Deliveries();
	void Choose_Cases(int32 Size, TArray<class ADeliveryCase_C*>* Result);
	void ExecuteUbergraph_Task_DelivryIn(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Select_Cases(int32 Count);
	void Start_Task(double Delay);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Task_DelivryIn_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Task_DelivryIn_C")
	}
	static class ATask_DelivryIn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATask_DelivryIn_C>();
	}
};
DUMPER7_ASSERTS_ATask_DelivryIn_C;

}

