#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_Scanner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Task_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Task_Scanner.Task_Scanner_C
// 0x0028 (0x0398 - 0x0370)
class ATask_Scanner_C final : public ATask_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Task_Scanner_C;                     // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Placed;                                            // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Random;                                            // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AScanner_Machine_C*                     Scanner_Ref;                                       // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AScanner_Screen_C*                      Screen_Ref;                                        // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AScanner_PC_C*                          PC_Ref;                                            // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void Clear();
	void ExecuteUbergraph_Task_Scanner(int32 EntryPoint);
	void Finish();
	void ReceiveBeginPlay();
	void Start_Task(double Delay);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Task_Scanner_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Task_Scanner_C")
	}
	static class ATask_Scanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATask_Scanner_C>();
	}
};
DUMPER7_ASSERTS_ATask_Scanner_C;

}

