#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_Alim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Task_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Task_Alim.Task_Alim_C
// 0x0070 (0x03E0 - 0x0370)
class ATask_Alim_C final : public ATask_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Task_Alim_C;                        // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AVent_C*>                        Vents;                                             // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AItem_Spawner_C*>                Out_Actors;                                        // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AVent_C*>                        Task_Vents;                                        // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Alims_Count;                                       // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Batteries_Rab;                                     // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Charge_Speed;                                      // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AAlimBox_C*>                     Alims;                                             // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AAlimBox_C*>                     Task_Alims;                                        // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         Fuses_Rab;                                         // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Chack_All_Alims();
	void Check_Alims_State(bool* Finished, int32* Count);
	void ExecuteUbergraph_Task_Alim(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Select_Alims(int32 Count);
	void Start_Task(double Delay);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Task_Alim_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Task_Alim_C")
	}
	static class ATask_Alim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATask_Alim_C>();
	}
};
DUMPER7_ASSERTS_ATask_Alim_C;

}

