#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_Machine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Task_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Task_Machine.Task_Machine_C
// 0x0040 (0x03B0 - 0x0370)
class ATask_Machine_C final : public ATask_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Task_Machine_C;                     // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Placed;                                            // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Random;                                            // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABottleSlot_C*>                  Bottles;                                           // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABottleSlot_C*>                  Task_Bottles;                                      // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AMachinePannel_C*>               Machines;                                          // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void Check_Machines(bool* End);
	void Check_Machines_End();
	void Clear();
	void ExecuteUbergraph_Task_Machine(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Start_Task(double Delay);
	void Suffle_Bottles();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Task_Machine_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Task_Machine_C")
	}
	static class ATask_Machine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATask_Machine_C>();
	}
};
DUMPER7_ASSERTS_ATask_Machine_C;

}

