#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_Pizzushi

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Task_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Task_Pizzushi.Task_Pizzushi_C
// 0x0038 (0x03A8 - 0x0370)
class ATask_Pizzushi_C final : public ATask_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Task_Pizzushi_C;                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Placed;                                            // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Random;                                            // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APizzushi_Table_C*>              Tables;                                            // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class APizzushi_Table_C*>              Task_Tables;                                       // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         Count;                                             // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Containers;                                        // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Check_Tables();
	void Check_Tables_Finish(bool* Finish, int32* Count_0);
	void Clear();
	void ExecuteUbergraph_Task_Pizzushi(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Select_Tables(int32 Count_0, TArray<class APizzushi_Table_C*>* Task_Tables_0);
	void Start_Task(double Delay);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Task_Pizzushi_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Task_Pizzushi_C")
	}
	static class ATask_Pizzushi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATask_Pizzushi_C>();
	}
};
DUMPER7_ASSERTS_ATask_Pizzushi_C;

}

