#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "RigVM_structs.hpp"
#include "PBIK_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChaosDestructionEvent_SWC;

// PropertyBag Transient.PropertyBag_a3f1fda870e77d24
// 0x0860 (0x0860 - 0x0000)
struct FPropertyBag_a3f1fda870e77d24 final
{
public:
	struct FRigVMInstructionSetExecuteState       BlockExecuteState_1263208315;                      // 0x0000(0x0050)(Edit)
	struct FVector                                RigVMModel___MathVectorScale_1_Result;             // 0x0050(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatClamp_Result;                // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatDiv_Result;                  // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatDiv_B;                       // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___If_Result;                            // 0x0078(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___MathFloatGreater_Result;              // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___MathFloatGreater_A;                   // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___If_Condition;                         // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___If_True;                              // 0x0090(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_Result;                  // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatPow_Result;                  // 0x009C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatRemap_Result;                // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatRemap_Value;                 // 0x00A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___If_False;                             // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionFromRotator_Result;     // 0x00B0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterpVectorV2_1_Result;        // 0x00D0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterpVectorV2_1_Velocity;      // 0x00E8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        RigVMModel___SpringInterpVectorV2_1_SimulatedResult; // 0x0100(0x0010)(Edit)
	TArray<struct FVectorSpringState>             RigVMModel___SpringInterpVectorV2_1_SpringState;   // 0x0110(0x0010)(Edit)
	struct FRotator                               RigVMModel___MathQuaternionFromRotator_Rotator__IO; // 0x0120(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                RigVMModel___SpringInterpVectorV2_Result;          // 0x0138(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterpVectorV2_Velocity;        // 0x0150(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        RigVMModel___SpringInterpVectorV2_SimulatedResult; // 0x0168(0x0010)(Edit)
	TArray<struct FVectorSpringState>             RigVMModel___SpringInterpVectorV2_SpringState;     // 0x0178(0x0010)(Edit)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_1_Value__IO;     // 0x0190(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_1_CachedIndex;   // 0x01F0(0x0010)(Edit)
	struct FVector                                RigVMModel___SpringInterpVectorV2_2_Result;        // 0x0200(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_2_2_Result;              // 0x0218(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_2_2_A;                   // 0x021C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_2_2_B;                   // 0x0220(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_2_Result;                // 0x0224(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_2_A;                     // 0x0228(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_2_B;                     // 0x022C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_2_1_Result;              // 0x0230(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_2_1_A;                   // 0x0234(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_2_1_B;                   // 0x0238(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___SpringInterpVectorV2_2_Target__IO;    // 0x0240(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterpVectorV2_2_Velocity;      // 0x0258(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        RigVMModel___SpringInterpVectorV2_2_SimulatedResult; // 0x0270(0x0010)(Edit)
	TArray<struct FVectorSpringState>             RigVMModel___SpringInterpVectorV2_2_SpringState;   // 0x0280(0x0010)(Edit)
	struct FVector                                RigVMModel___MathVectorScale_Result;               // 0x0290(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_Transform;       // 0x02B0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_CachedIndex;     // 0x0310(0x0010)(Edit)
	struct FVector                                RigVMModel___MathVectorScale_Value;                // 0x0320(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetRelativeTransformForItem_Value__IO; // 0x0340(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_CachedChild; // 0x03A0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_CachedParent; // 0x03B0(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_Transform;     // 0x03C0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_CachedIndex;   // 0x0420(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_CachedIndex;     // 0x0430(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_Transform;   // 0x0440(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_CachedIndex; // 0x04A0(0x0010)(Edit)
	struct FVector                                RigVMModel___RigUnit_SetTranslation_Value;         // 0x04B0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTranslation_CachedIndex;   // 0x04C8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRotation_CachedIndex;      // 0x04D8(0x0010)(Edit)
	uint8                                         Pad_4E8[0x8];                                      // 0x04E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_2_Transform;     // 0x04F0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_2_CachedIndex;   // 0x0550(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_2_CachedIndex;   // 0x0560(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_2_1_Transform;   // 0x0570(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_2_1_CachedIndex; // 0x05D0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_2_1_CachedIndex; // 0x05E0(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionFromRotator_1_Result;   // 0x05F0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___MathQuaternionFromRotator_1_Rotator__IO; // 0x0610(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRotation_1_CachedIndex;    // 0x0628(0x0010)(Edit)
	uint8                                         Pad_638[0x8];                                      // 0x0638(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_5_1_Transform;   // 0x0640(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_5_1_CachedIndex; // 0x06A0(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_2_1_1_1_1_Transform; // 0x06B0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_2_1_1_1_1_CachedIndex; // 0x0710(0x0010)(Edit)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_1_Effectors__IO;               // 0x0720(0x0010)(Edit)
	TArray<TArray<int32>>                         RigVMModel___PBIK_1_1_EffectorSolverIndices;       // 0x0730(0x0010)(Edit)
	TArray<struct FPBIKWorkData>                  RigVMModel___PBIK_1_1_WorkData;                    // 0x0740(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_5_1_1_Transform; // 0x0750(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_5_1_1_CachedIndex; // 0x07B0(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_2_1_1_1_1_1_Transform; // 0x07C0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_2_1_1_1_1_1_CachedIndex; // 0x0820(0x0010)(Edit)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_1_1_Effectors__IO;             // 0x0830(0x0010)(Edit)
	TArray<TArray<int32>>                         RigVMModel___PBIK_1_1_1_EffectorSolverIndices;     // 0x0840(0x0010)(Edit)
	TArray<struct FPBIKWorkData>                  RigVMModel___PBIK_1_1_1_WorkData;                  // 0x0850(0x0010)(Edit)
};
DUMPER7_ASSERTS_FPropertyBag_a3f1fda870e77d24;

// PropertyBag Transient.PropertyBag_7351f0fe2dc9bbd
// 0x012C (0x012C - 0x0000)
struct FPropertyBag_7351f0fe2dc9bbd final
{
public:
	struct FRigElementKey                         RigVMModel___RigUnit_SetRelativeTransformForItem_Child__Const; // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetRelativeTransformForItem_Parent__Const; // 0x000C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetRelativeTransformForItem_bParentInitial__Const; // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___RigUnit_GetRelativeTransformForItem_Child__Const; // 0x001C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetRelativeTransformForItem_Parent__Const; // 0x0028(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigUnit_SetRelativeTransformForItem_Weight__Const; // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetRelativeTransformForItem_bPropagateToChildren__Const; // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___RigUnit_SetRelativeTransformForItem_1_Child__Const; // 0x003C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetRelativeTransformForItem_1_Parent__Const; // 0x0048(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetRelativeTransformForItem_1_Child__Const; // 0x0054(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetRelativeTransformForItem_1_Parent__Const; // 0x0060(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetRelativeTransformForItem_2_Child__Const; // 0x006C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetRelativeTransformForItem_2_Parent__Const; // 0x0078(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetRelativeTransformForItem_2_Child__Const; // 0x0084(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetRelativeTransformForItem_2_Parent__Const; // 0x0090(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetRelativeTransformForItem_1_1_Child__Const; // 0x009C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetRelativeTransformForItem_1_1_Parent__Const; // 0x00A8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetRelativeTransformForItem_1_1_Child__Const; // 0x00B4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetRelativeTransformForItem_1_1_Parent__Const; // 0x00C0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetRelativeTransformForItem_2_1_Child__Const; // 0x00CC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetRelativeTransformForItem_2_1_Parent__Const; // 0x00D8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetRelativeTransformForItem_2_1_Child__Const; // 0x00E4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetRelativeTransformForItem_2_1_Parent__Const; // 0x00F0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetRelativeTransformForItem_2_1_1_Child__Const; // 0x00FC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetRelativeTransformForItem_2_1_1_Parent__Const; // 0x0108(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetRelativeTransformForItem_2_1_1_Child__Const; // 0x0114(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetRelativeTransformForItem_2_1_1_Parent__Const; // 0x0120(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_7351f0fe2dc9bbd;

// PropertyBag Transient.PropertyBag_e39f682a0d503c4e
// 0x0490 (0x0490 - 0x0000)
struct FPropertyBag_e39f682a0d503c4e final
{
public:
	bool                                          RigVMModel___HierarchyGetPoseItemArray_Initial__Const; // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigElementType                               RigVMModel___HierarchyGetPoseItemArray_ElementType__Const; // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 RigVMModel___HierarchyGetPoseItemArray_ItemsToGet__Const; // 0x0008(0x0010)(Edit)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_Item__Const;     // 0x0018(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___RigUnit_SetTransform_Space__Const;    // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0xB];                                       // 0x0025(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_Value__Const;    // 0x0030(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigUnit_SetTransform_Weight__Const;   // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetTransform_bPropagateToChildren__Const; // 0x0094(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_1_Item__Const;   // 0x0098(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTranslation_Item__Const;   // 0x00A4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_2_3_Item__Const; // 0x00B0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___RigUnit_SetRotation_Value__Const;     // 0x00C0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_3_Item__Const;   // 0x00E0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_Item__Const;   // 0x00EC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_4_Item__Const;   // 0x00F8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_1_Item__Const; // 0x0104(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_1_3_Item__Const; // 0x0110(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_1_1_Item__Const; // 0x011C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_1_1_2_Item__Const; // 0x0128(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_1_2_2_Item__Const; // 0x0134(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_1_2_Item__Const; // 0x0140(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_1_2_1_Item__Const; // 0x014C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_1_1_1_Item__Const; // 0x0158(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_1_1_1_1_Item__Const; // 0x0164(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_1_2_1_Item__Const; // 0x0170(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_1_1_1_1_Item__Const; // 0x017C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_4_Item__Const;   // 0x0188(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatLerp_A__Const;               // 0x0194(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___AimBoneMath_InputTransform__Const;    // 0x01A0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                RigVMModel___AimBoneMath_Secondary__Const;         // 0x0200(0x0048)(Edit, NoDestructor)
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         RigVMModel___AimBoneMath_DebugSettings__Const;     // 0x0250(0x0070)(Edit, NoDestructor)
	float                                         RigVMModel___If_True__Const;                       // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterpV2_Strength__Const;       // 0x02C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_2_B__Const;              // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterpVectorV2_CriticalDamping__Const; // 0x02CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterpVectorV2_Force__Const;    // 0x02D0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterpVectorV2_1_Strength__Const; // 0x02E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatLerp_1_B__Const;             // 0x02EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatDiv_1_B__Const;              // 0x02F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatPow_B__Const;                // 0x02F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___PBIK_Root__Const;                     // 0x02F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_Effectors__Const;                // 0x0300(0x0010)(Edit)
	float                                         RigVMModel___MathFloatPow_1_B__Const;              // 0x0310(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_BoneSettings__Const;             // 0x0318(0x0010)(Edit)
	TArray<class FName>                           RigVMModel___PBIK_ExcludedBones__Const;            // 0x0328(0x0010)(Edit)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_Settings__Const;                 // 0x0338(0x0040)(Edit, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_Debug__Const;                    // 0x0378(0x0008)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___RigUnit_SetRotation_1_Item__Const;    // 0x0380(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTranslation_1_1_Item__Const; // 0x038C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___DebugLineItemSpace_3_Color__Const;    // 0x0398(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___PBIK_1_Root__Const;                   // 0x03A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_Effectors__Const;              // 0x03B0(0x0010)(Edit)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_5_Item__Const;   // 0x03C0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_1_BoneSettings__Const;           // 0x03D0(0x0010)(Edit)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_1_Settings__Const;               // 0x03E0(0x0040)(Edit, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_1_Debug__Const;                  // 0x0420(0x0008)(Edit, NoDestructor)
	class FName                                   RigVMModel___PBIK_1_1_Root__Const;                 // 0x0428(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_1_Effectors__Const;            // 0x0430(0x0010)(Edit)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_5_1_Item__Const; // 0x0440(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___DebugLineItemSpace_Color__Const;      // 0x044C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___DebugLineItemSpace_1_Color__Const;    // 0x045C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___DebugLineItemSpace_1_1_Color__Const;  // 0x046C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_2_2_Item__Const; // 0x047C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_e39f682a0d503c4e;

// PropertyBag Transient.PropertyBag_248265db3a0ea5bb
// 0x2570 (0x2570 - 0x0000)
struct FPropertyBag_248265db3a0ea5bb final
{
public:
	struct FRigPose                               RigVMModel___HierarchyGetPoseItemArray_Pose;       // 0x0000(0x0070)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_CachedIndex;     // 0x0070(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_1_CachedIndex;   // 0x0080(0x0010)(Edit)
	struct FTransform                             RigVMModel___MathTransformMakeAbsolute_Global;     // 0x0090(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___MathTransformMakeAbsolute_Local__IO;  // 0x00F0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_2_3_Transform;   // 0x0150(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_2_3_CachedIndex; // 0x01B0(0x0010)(Edit)
	struct FVector                                RigVMModel___RigUnit_SetTranslation_Value;         // 0x01C0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTranslation_CachedIndex;   // 0x01D8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRotation_CachedIndex;      // 0x01E8(0x0010)(Edit)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_3_Value__IO;     // 0x0200(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_3_CachedIndex;   // 0x0260(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_4_Transform;     // 0x0270(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_4_CachedIndex;   // 0x02D0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_2_CachedIndex;   // 0x02E0(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_3_Transform; // 0x02F0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_3_CachedIndex; // 0x0350(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_2_1_1_CachedIndex; // 0x0360(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_1_2_Transform; // 0x0370(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_1_2_CachedIndex; // 0x03D0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_2_1_1_1_CachedIndex; // 0x03E0(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_2_2_Transform; // 0x03F0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_2_2_CachedIndex; // 0x0450(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_2_1_1_2_2_CachedIndex; // 0x0460(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_2_1_Transform; // 0x0470(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_2_1_CachedIndex; // 0x04D0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_2_1_1_2_CachedIndex; // 0x04E0(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_1_1_1_Transform; // 0x04F0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_1_1_1_CachedIndex; // 0x0550(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_2_1_1_1_1_CachedIndex; // 0x0560(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_2_1_1_Transform; // 0x0570(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_2_1_1_CachedIndex; // 0x05D0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_2_1_1_2_1_CachedIndex; // 0x05E0(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_1_1_1_1_Transform; // 0x05F0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_1_1_1_1_CachedIndex; // 0x0650(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_2_1_1_1_1_1_CachedIndex; // 0x0660(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_2_1_1_1_Transform; // 0x0670(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_2_1_1_1_CachedIndex; // 0x06D0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_2_1_1_2_1_1_CachedIndex; // 0x06E0(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_1_1_1_1_1_Transform; // 0x06F0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_1_1_1_1_1_CachedIndex; // 0x0750(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_2_1_1_1_1_1_1_CachedIndex; // 0x0760(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_3_Transform;   // 0x0770(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_3_CachedIndex; // 0x07D0(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_SetTransform_4_Value__IO;     // 0x07E0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_4_CachedIndex;   // 0x0840(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionFromRotator_Result;     // 0x0850(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatLerp_Result;                 // 0x0870(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatLerp_B;                      // 0x0874(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatLerp_T;                      // 0x0878(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C[0x4];                                      // 0x087C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               RigVMModel___MathQuaternionFromRotator_Rotator__IO; // 0x0880(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_898[0x8];                                      // 0x0898(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_3_1_Value__IO;   // 0x08A0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_3_1_CachedIndex; // 0x0900(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionFromRotator_1_Result;   // 0x0910(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___MathQuaternionFromRotator_1_Rotator__IO; // 0x0930(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_948[0x8];                                      // 0x0948(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_4_1_Value__IO;   // 0x0950(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_4_1_CachedIndex; // 0x09B0(0x0010)(Edit)
	float                                         RigVMModel___SpringInterpV2_Result;                // 0x09C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_Result;                  // 0x09C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___MathQuaternionToRotator_3_Result;     // 0x09C8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             RigVMModel___AimBoneMath_Result;                   // 0x09E0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_4_2_Transform;   // 0x0A40(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_4_2_CachedIndex; // 0x0AA0(0x0010)(Edit)
	struct FRigUnit_AimItem_Target                RigVMModel___AimBoneMath_Primary__IO;              // 0x0AB0(0x0048)(Edit, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimBoneMath_PrimaryCachedSpace;       // 0x0AF8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___AimBoneMath_SecondaryCachedSpace;     // 0x0B08(0x0010)(Edit)
	TArray<bool>                                  RigVMModel___AimBoneMath_bIsInitialized;           // 0x0B18(0x0010)(Edit)
	uint8                                         Pad_B28[0x8];                                      // 0x0B28(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___MathQuaternionToRotator_3_Value;      // 0x0B30(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_A;                       // 0x0B50(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___If_Result;                            // 0x0B54(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___MathFloatGreater_Result;              // 0x0B58(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B59[0x3];                                      // 0x0B59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___MathFloatGreater_A;                   // 0x0B5C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterpV2_Velocity;              // 0x0B60(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B64[0x4];                                      // 0x0B64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 RigVMModel___SpringInterpV2_SimulatedResult;       // 0x0B68(0x0010)(Edit)
	TArray<struct FFloatSpringState>              RigVMModel___SpringInterpV2_SpringState;           // 0x0B78(0x0010)(Edit)
	float                                         RigVMModel___MathFloatMul_2_Result;                // 0x0B88(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8C[0x4];                                      // 0x0B8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___SpringInterpVectorV2_Result;          // 0x0B90(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterpVectorV2_Velocity;        // 0x0BA8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        RigVMModel___SpringInterpVectorV2_SimulatedResult; // 0x0BC0(0x0010)(Edit)
	TArray<struct FVectorSpringState>             RigVMModel___SpringInterpVectorV2_SpringState;     // 0x0BD0(0x0010)(Edit)
	struct FVector                                RigVMModel___SpringInterpVectorV2_1_Result;        // 0x0BE0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterpVectorV2_1_Velocity;      // 0x0BF8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        RigVMModel___SpringInterpVectorV2_1_SimulatedResult; // 0x0C10(0x0010)(Edit)
	TArray<struct FVectorSpringState>             RigVMModel___SpringInterpVectorV2_1_SpringState;   // 0x0C20(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_4_1_Transform;   // 0x0C30(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_4_1_CachedIndex; // 0x0C90(0x0010)(Edit)
	struct FVector                                RigVMModel___MathVectorAdd_1_Result;               // 0x0CA0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathVectorAdd_Result;                 // 0x0CB8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathVectorAdd_A;                      // 0x0CD0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatLerp_1_Result;               // 0x0CE8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatPow_Result;                  // 0x0CEC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatDiv_1_Result;                // 0x0CF0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatAbs_Result;                  // 0x0CF4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatAbs_Value;                   // 0x0CF8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CFC[0x4];                                      // 0x0CFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___MathVectorAdd_B__IO;                  // 0x0D00(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathVectorAdd_1_B__IO;                // 0x0D18(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_SetTransform_5_Value__IO;     // 0x0D30(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_5_CachedIndex;   // 0x0D90(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_2_4_Transform;   // 0x0DA0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_2_4_CachedIndex; // 0x0E00(0x0010)(Edit)
	float                                         RigVMModel___MathFloatMul_3_Result;                // 0x0E10(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_3_A;                     // 0x0E14(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatLerp_1_1_Result;             // 0x0E18(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatPow_1_Result;                // 0x0E1C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatDiv_1_1_Result;              // 0x0E20(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatAbs_1_Result;                // 0x0E24(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatAbs_1_Value;                 // 0x0E28(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2C[0x4];                                      // 0x0E2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_1_Transform;   // 0x0E30(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_1_CachedIndex; // 0x0E90(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_10_Transform;    // 0x0EA0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_10_CachedIndex;  // 0x0F00(0x0010)(Edit)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_Effectors__IO;                   // 0x0F10(0x0010)(Edit)
	TArray<TArray<int32>>                         RigVMModel___PBIK_EffectorSolverIndices;           // 0x0F20(0x0010)(Edit)
	TArray<struct FPBIKWorkData>                  RigVMModel___PBIK_WorkData;                        // 0x0F30(0x0010)(Edit)
	struct FTransform                             RigVMModel___PoseGetTransform_Transform;           // 0x0F40(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___PoseGetTransform_Valid;               // 0x0FA0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA1[0x3];                                      // 0x0FA1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___PoseGetTransform_CurveValue;          // 0x0FA4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 RigVMModel___PoseGetTransform_CachedPoseElementIndex; // 0x0FA8(0x0010)(Edit)
	TArray<int32>                                 RigVMModel___PoseGetTransform_CachedPoseHash;      // 0x0FB8(0x0010)(Edit)
	uint8                                         Pad_FC8[0x8];                                      // 0x0FC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___RigUnit_SetRotation_1_Value;          // 0x0FD0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatDiv_Result;                  // 0x0FF0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatDiv_A;                       // 0x0FF4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRotation_1_CachedIndex;    // 0x0FF8(0x0010)(Edit)
	uint8                                         Pad_1008[0x8];                                     // 0x1008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___PoseGetTransform_1_Transform;         // 0x1010(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___PoseGetTransform_1_Valid;             // 0x1070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1071[0x3];                                     // 0x1071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___PoseGetTransform_1_CurveValue;        // 0x1074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 RigVMModel___PoseGetTransform_1_CachedPoseElementIndex; // 0x1078(0x0010)(Edit)
	TArray<int32>                                 RigVMModel___PoseGetTransform_1_CachedPoseHash;    // 0x1088(0x0010)(Edit)
	uint8                                         Pad_1098[0x8];                                     // 0x1098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___RigUnit_SetRotation_1_1_Value;        // 0x10A0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigUnit_SetRotation_1_1_Weight;       // 0x10C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C4[0x4];                                     // 0x10C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRotation_1_1_CachedIndex;  // 0x10C8(0x0010)(Edit)
	uint8                                         Pad_10D8[0x8];                                     // 0x10D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___MathQuaternionMul_1_1_Result;         // 0x10E0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionMul_1_Result;           // 0x1100(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_4_Transform;   // 0x1120(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_4_CachedIndex; // 0x1180(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionMul_1_A;                // 0x1190(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionFromAxisAndAngle_1_Result; // 0x11B0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathVectorLength_2_Result;            // 0x11D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D4[0xC];                                     // 0x11D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___MathQuaternionFromRotator_2_1_Result; // 0x11E0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_1_Result;                // 0x1200(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_1_A;                     // 0x1204(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_1_B;                     // 0x1208(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_120C[0x4];                                     // 0x120C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               RigVMModel___MathQuaternionFromRotator_2_1_Rotator__IO; // 0x1210(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRotation_2_CachedIndex;    // 0x1228(0x0010)(Edit)
