#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DataPC_Message_UI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DataPC_Message_UI.W_DataPC_Message_UI_C
// 0x0030 (0x0300 - 0x02D0)
class UW_DataPC_Message_UI_C final : public UUserWidget
{
public:
	class UTextBlock*                             TextBlock_42;                                      // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Partner_Room;                                      // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message_Text;                                      // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	struct FSlateColor GetColorAndOpacity();
	class FText GetText_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_DataPC_Message_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_DataPC_Message_UI_C")
	}
	static class UW_DataPC_Message_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_DataPC_Message_UI_C>();
	}
};
DUMPER7_ASSERTS_UW_DataPC_Message_UI_C;

}

