#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DataPC_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Enum_Sectors_structs.hpp"
#include "E_DataPC_State_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DataPC_UI.W_DataPC_UI_C
// 0x0028 (0x02F8 - 0x02D0)
class UW_DataPC_UI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             HeadText;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MessageList;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Partner_Room;                                      // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Underscore;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Clear_Messages();
	void Construct();
	void Draw_Message(const class FString& Message, const struct FLinearColor& Color);
	void ExecuteUbergraph_W_DataPC_UI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Index(const struct FStr_ItemSpawnLocation& Location);
	void Set_Partner(int32 Room);
	void Set_Screen(E_DataPC_State State, int32 Value);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_DataPC_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_DataPC_UI_C")
	}
	static class UW_DataPC_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_DataPC_UI_C>();
	}
};
DUMPER7_ASSERTS_UW_DataPC_UI_C;

}

