#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DebugSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DebugSpawner.W_DebugSpawner_C
// 0x0040 (0x0310 - 0x02D0)
class UW_DebugSpawner_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        FPS;                                               // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APC_C*                                  Player_Ref;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Delta;                                             // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Second_Time;                                       // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_DebugSpawnItem_C*>            ListItem;                                          // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Cheat_Activation();
	void Construct();
	void ExecuteUbergraph_W_DebugSpawner(int32 EntryPoint);
	void OnInitialized();
	void Set_List(const TArray<struct FStr_Item>& Items);
	void Set_Selection(int32 Index_0, bool Show_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_DebugSpawner_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_DebugSpawner_C")
	}
	static class UW_DebugSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_DebugSpawner_C>();
	}
};
DUMPER7_ASSERTS_UW_DebugSpawner_C;

}

