#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_GraphicSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_GraphicSettings.W_GraphicSettings_C.BndEvt__W_GraphicSettings_Selector_AA_K2Node_ComponentBoundEvent_6_On Value Change__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_AA_K2Node_ComponentBoundEvent_6_On_Value_Change__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_AA_K2Node_ComponentBoundEvent_6_On_Value_Change__DelegateSignature;

// Function W_GraphicSettings.W_GraphicSettings_C.BndEvt__W_GraphicSettings_Selector_DOF_K2Node_ComponentBoundEvent_2_On Value Change__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_DOF_K2Node_ComponentBoundEvent_2_On_Value_Change__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_DOF_K2Node_ComponentBoundEvent_2_On_Value_Change__DelegateSignature;

// Function W_GraphicSettings.W_GraphicSettings_C.BndEvt__W_GraphicSettings_Selector_Fog_K2Node_ComponentBoundEvent_0_On Value Change__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_Fog_K2Node_ComponentBoundEvent_0_On_Value_Change__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_Fog_K2Node_ComponentBoundEvent_0_On_Value_Change__DelegateSignature;

// Function W_GraphicSettings.W_GraphicSettings_C.BndEvt__W_GraphicSettings_Selector_Reflex_K2Node_ComponentBoundEvent_9_On Value Change__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_Reflex_K2Node_ComponentBoundEvent_9_On_Value_Change__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_Reflex_K2Node_ComponentBoundEvent_9_On_Value_Change__DelegateSignature;

// Function W_GraphicSettings.W_GraphicSettings_C.BndEvt__W_GraphicSettings_Selector_Resolution_K2Node_ComponentBoundEvent_1_On Apply__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_Resolution_K2Node_ComponentBoundEvent_1_On_Apply__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_Resolution_K2Node_ComponentBoundEvent_1_On_Apply__DelegateSignature;

// Function W_GraphicSettings.W_GraphicSettings_C.BndEvt__W_GraphicSettings_Selector_ScreenMode_K2Node_ComponentBoundEvent_8_On Value Change__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_ScreenMode_K2Node_ComponentBoundEvent_8_On_Value_Change__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_ScreenMode_K2Node_ComponentBoundEvent_8_On_Value_Change__DelegateSignature;

// Function W_GraphicSettings.W_GraphicSettings_C.BndEvt__W_GraphicSettings_Selector_Shadow_K2Node_ComponentBoundEvent_3_On Value Change__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_Shadow_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_Shadow_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature;

// Function W_GraphicSettings.W_GraphicSettings_C.BndEvt__W_GraphicSettings_Selector_Vsync_K2Node_ComponentBoundEvent_10_On Value Change__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_Vsync_K2Node_ComponentBoundEvent_10_On_Value_Change__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_GraphicSettings_C_BndEvt__W_GraphicSettings_Selector_Vsync_K2Node_ComponentBoundEvent_10_On_Value_Change__DelegateSignature;

// Function W_GraphicSettings.W_GraphicSettings_C.BndEvt__W_GraphicSettings_Slider_FPSCap_K2Node_ComponentBoundEvent_7_On Confirm Value__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_GraphicSettings_C_BndEvt__W_GraphicSettings_Slider_FPSCap_K2Node_ComponentBoundEvent_7_On_Confirm_Value__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_GraphicSettings_C_BndEvt__W_GraphicSettings_Slider_FPSCap_K2Node_ComponentBoundEvent_7_On_Confirm_Value__DelegateSignature;

// Function W_GraphicSettings.W_GraphicSettings_C.BndEvt__W_GraphicSettings_Slider_RenderScale_K2Node_ComponentBoundEvent_5_On Confirm Value__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_GraphicSettings_C_BndEvt__W_GraphicSettings_Slider_RenderScale_K2Node_ComponentBoundEvent_5_On_Confirm_Value__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_GraphicSettings_C_BndEvt__W_GraphicSettings_Slider_RenderScale_K2Node_ComponentBoundEvent_5_On_Confirm_Value__DelegateSignature;

// Function W_GraphicSettings.W_GraphicSettings_C.ExecuteUbergraph_W_GraphicSettings
// 0x00B0 (0x00B0 - 0x0000)
struct W_GraphicSettings_C_ExecuteUbergraph_W_GraphicSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   Temp_byte_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   Temp_byte_Variable_2;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_7;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APC_C*                                  K2Node_DynamicCast_AsPC;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Index_6;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_5;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value_1;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_4;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_3;                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   K2Node_Select_Default_1;                           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Index_2;                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_GraphicSettings_C_ExecuteUbergraph_W_GraphicSettings;

// Function W_GraphicSettings.W_GraphicSettings_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_GraphicSettings_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_GraphicSettings_C_Tick;

// Function W_GraphicSettings.W_GraphicSettings_C.Update Graphic Settings
// 0x0048 (0x0048 - 0x0000)
struct W_GraphicSettings_C_Update_Graphic_Settings final
{
public:
	EWindowMode                                   Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FIntPoint>                      CallFunc_Get_Resolutions_Resolutions;              // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_GraphicSettings_C_Update_Graphic_Settings;

}

