#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Menu_Gamepad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Menu_Gamepad.W_Menu_Gamepad_C
// 0x0070 (0x0340 - 0x02D0)
class UW_Menu_Gamepad_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Settings_Value_C*                    Setting_Boost;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Value_C*                    Setting_deadzone;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Selection_C*                Setting_Gamepad;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Selection_C*                Setting_Horizontal;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Value_C*                    Setting_limit;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Value_C*                    Setting_Linearity;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Value_C*                    Setting_Ratio;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Value_C*                    Setting_sensitivity;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Selection_C*                Setting_Vertical;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_2;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_4;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APC_C*                                  PC_Ref;                                            // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Resolution;                                        // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   ScreenMode;                                        // 0x033C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_Menu_Gamepad_Setting_Boost_K2Node_ComponentBoundEvent_6_Value_Changed__DelegateSignature(double Value);
	void BndEvt__W_Menu_Gamepad_Setting_deadzone_K2Node_ComponentBoundEvent_5_Value_Changed__DelegateSignature(double Value);
	void BndEvt__W_Menu_Gamepad_Setting_Horizontal_K2Node_ComponentBoundEvent_10_Value_Changed__DelegateSignature(int32 Index_0);
	void BndEvt__W_Menu_Gamepad_Setting_limit_K2Node_ComponentBoundEvent_7_Value_Changed__DelegateSignature(double Value);
	void BndEvt__W_Menu_Gamepad_Setting_Linearity_K2Node_ComponentBoundEvent_4_Value_Changed__DelegateSignature(double Value);
	void BndEvt__W_Menu_Gamepad_Setting_Ratio_K2Node_ComponentBoundEvent_8_Value_Changed__DelegateSignature(double Value);
	void BndEvt__W_Menu_Gamepad_Setting_sensitivity_K2Node_ComponentBoundEvent_3_Value_Changed__DelegateSignature(double Value);
	void BndEvt__W_Menu_Gamepad_Setting_Vertical_K2Node_ComponentBoundEvent_9_Value_Changed__DelegateSignature(int32 Index_0);
	void BndEvt__W_Menu_Inputs_Setting_Vertical_K2Node_ComponentBoundEvent_1_Value_Changed__DelegateSignature(int32 Index_0);
	void ExecuteUbergraph_W_Menu_Gamepad(int32 EntryPoint);
	void OnInitialized();
	void Save_Ready();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Menu_Gamepad_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Menu_Gamepad_C")
	}
	static class UW_Menu_Gamepad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Menu_Gamepad_C>();
	}
};
DUMPER7_ASSERTS_UW_Menu_Gamepad_C;

}

