#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Menu_Gamecode

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Menu_Gamecode.W_Menu_Gamecode_C.ExecuteUbergraph_W_Menu_Gamecode
// 0x0090 (0x0090 - 0x0000)
struct W_Menu_Gamecode_C_ExecuteUbergraph_W_Menu_Gamecode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMainGI_C*                              K2Node_DynamicCast_AsMain_GI;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, int64>                    CallFunc_Generate_FilesCode_Files;                 // 0x0020(0x0050)()
	class FString                                 CallFunc_Generate_FilesCode_Code;                  // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0010)()
};
DUMPER7_ASSERTS_W_Menu_Gamecode_C_ExecuteUbergraph_W_Menu_Gamecode;

// Function W_Menu_Gamecode.W_Menu_Gamecode_C.OnGenerateContentWidget
// 0x0028 (0x0028 - 0x0000)
struct W_Menu_Gamecode_C_OnGenerateContentWidget final
{
public:
	class FName                                   Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Settings_List_Button_C*              CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0018(0x0010)()
};
DUMPER7_ASSERTS_W_Menu_Gamecode_C_OnGenerateContentWidget;

// Function W_Menu_Gamecode.W_Menu_Gamecode_C.OnGenerateItemWidget
// 0x0028 (0x0028 - 0x0000)
struct W_Menu_Gamecode_C_OnGenerateItemWidget final
{
public:
	class FName                                   Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Settings_List_Item_C*                CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0018(0x0010)()
};
DUMPER7_ASSERTS_W_Menu_Gamecode_C_OnGenerateItemWidget;

}

