#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Menu_Gamepad

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Menu_Gamepad.W_Menu_Gamepad_C.BndEvt__W_Menu_Gamepad_Setting_Boost_K2Node_ComponentBoundEvent_6_Value Changed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_Boost_K2Node_ComponentBoundEvent_6_Value_Changed__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_Boost_K2Node_ComponentBoundEvent_6_Value_Changed__DelegateSignature;

// Function W_Menu_Gamepad.W_Menu_Gamepad_C.BndEvt__W_Menu_Gamepad_Setting_deadzone_K2Node_ComponentBoundEvent_5_Value Changed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_deadzone_K2Node_ComponentBoundEvent_5_Value_Changed__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_deadzone_K2Node_ComponentBoundEvent_5_Value_Changed__DelegateSignature;

// Function W_Menu_Gamepad.W_Menu_Gamepad_C.BndEvt__W_Menu_Gamepad_Setting_Horizontal_K2Node_ComponentBoundEvent_10_Value Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_Horizontal_K2Node_ComponentBoundEvent_10_Value_Changed__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_Horizontal_K2Node_ComponentBoundEvent_10_Value_Changed__DelegateSignature;

// Function W_Menu_Gamepad.W_Menu_Gamepad_C.BndEvt__W_Menu_Gamepad_Setting_limit_K2Node_ComponentBoundEvent_7_Value Changed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_limit_K2Node_ComponentBoundEvent_7_Value_Changed__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_limit_K2Node_ComponentBoundEvent_7_Value_Changed__DelegateSignature;

// Function W_Menu_Gamepad.W_Menu_Gamepad_C.BndEvt__W_Menu_Gamepad_Setting_Linearity_K2Node_ComponentBoundEvent_4_Value Changed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_Linearity_K2Node_ComponentBoundEvent_4_Value_Changed__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_Linearity_K2Node_ComponentBoundEvent_4_Value_Changed__DelegateSignature;

// Function W_Menu_Gamepad.W_Menu_Gamepad_C.BndEvt__W_Menu_Gamepad_Setting_Ratio_K2Node_ComponentBoundEvent_8_Value Changed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_Ratio_K2Node_ComponentBoundEvent_8_Value_Changed__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_Ratio_K2Node_ComponentBoundEvent_8_Value_Changed__DelegateSignature;

// Function W_Menu_Gamepad.W_Menu_Gamepad_C.BndEvt__W_Menu_Gamepad_Setting_sensitivity_K2Node_ComponentBoundEvent_3_Value Changed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_sensitivity_K2Node_ComponentBoundEvent_3_Value_Changed__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_sensitivity_K2Node_ComponentBoundEvent_3_Value_Changed__DelegateSignature;

// Function W_Menu_Gamepad.W_Menu_Gamepad_C.BndEvt__W_Menu_Gamepad_Setting_Vertical_K2Node_ComponentBoundEvent_9_Value Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_Vertical_K2Node_ComponentBoundEvent_9_Value_Changed__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Menu_Gamepad_C_BndEvt__W_Menu_Gamepad_Setting_Vertical_K2Node_ComponentBoundEvent_9_Value_Changed__DelegateSignature;

// Function W_Menu_Gamepad.W_Menu_Gamepad_C.BndEvt__W_Menu_Inputs_Setting_Vertical_K2Node_ComponentBoundEvent_1_Value Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_Menu_Gamepad_C_BndEvt__W_Menu_Inputs_Setting_Vertical_K2Node_ComponentBoundEvent_1_Value_Changed__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Menu_Gamepad_C_BndEvt__W_Menu_Inputs_Setting_Vertical_K2Node_ComponentBoundEvent_1_Value_Changed__DelegateSignature;

// Function W_Menu_Gamepad.W_Menu_Gamepad_C.ExecuteUbergraph_W_Menu_Gamepad
// 0x0090 (0x0090 - 0x0000)
struct W_Menu_Gamepad_C_ExecuteUbergraph_W_Menu_Gamepad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue_1;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue_2;             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue_3;             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue_4;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue_5;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APC_C*                                  K2Node_DynamicCast_AsPC;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Index_2;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue_6;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value_5;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_4;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_3;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_2;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_1;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue_7;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_2;             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue_8;             // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue_1;             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue_2;             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Menu_Gamepad_C_ExecuteUbergraph_W_Menu_Gamepad;

}

