#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Menu_Session

#include "Basic.hpp"

#include "OnlineSubsystemUtils_structs.hpp"
#include "Engine_structs.hpp"
#include "SteamCoreShared_structs.hpp"
#include "E_SessionVisilibity_structs.hpp"
#include "UMG_classes.hpp"
#include "E_SessionState_structs.hpp"
#include "E_LoadMessage_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Menu_Session.W_Menu_Session_C
// 0x0200 (0x04D0 - 0x02D0)
class UW_Menu_Session_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Settings_Button_C*                   B_CreateSession;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Button_C*                   B_CreateSession_1;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Button_C*                   B_StartSession;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           FriendList;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Button_C*                   RefreshButton;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Button_C*                   RefreshButton_1;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Selection_C*                S_ForceColor;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Selection_C*                S_Visibility;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ServerList;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Session_PlayerList;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_TextBox_C*                  T_SessionName;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Value_C*                    V_PlayerCount;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_4;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APC_C*                                  PC_Ref;                                            // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Resolution;                                        // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   ScreenMode;                                        // 0x0354(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainGI_C*                              GI_Ref;                                            // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	ESteamLobbyDistanceFilter                     Search_region;                                     // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Session_Name;                                      // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         PlayerCount;                                       // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMec_C*                                 Mec_Ref;                                           // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AMec_C*>                         Players;                                           // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<struct FOnlineFriendSteamCoreBlueprint> FriendsList;                                      // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Private;                                           // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SessionVisilibity                           Session_Visibility;                                // 0x03A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lock_Colors;                                       // 0x03AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AB[0x5];                                      // 0x03AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintSessionResult                Invite_Result;                                     // 0x03B0(0x0120)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__W_Menu_Session_B_CreateSession_1_K2Node_ComponentBoundEvent_5_Pressed__DelegateSignature();
	void BndEvt__W_Menu_Session_B_StartSession_K2Node_ComponentBoundEvent_1_Pressed__DelegateSignature();
	void BndEvt__W_Menu_Session_RefreshButton_1_K2Node_ComponentBoundEvent_6_Pressed__DelegateSignature();
	void BndEvt__W_Menu_Session_RefreshButton_K2Node_ComponentBoundEvent_0_Pressed__DelegateSignature();
	void BndEvt__W_Menu_Session_S_ForceColor_K2Node_ComponentBoundEvent_2_Value_Changed__DelegateSignature(int32 Index_0);
	void BndEvt__W_Menu_Session_S_Visibility_K2Node_ComponentBoundEvent_7_Value_Changed__DelegateSignature(int32 Index_0);
	void BndEvt__W_Menu_Session_T_SessionName_K2Node_ComponentBoundEvent_4_Text_Valided__DelegateSignature(const class FText& Text);
	void BndEvt__W_Menu_Session_T_SessionName_K2Node_ComponentBoundEvent_9_Text_Changed__DelegateSignature(const class FText& Text);
	void BndEvt__W_Menu_Session_V_PlayerCount_K2Node_ComponentBoundEvent_8_Value_Changed__DelegateSignature(double Value);
	void BndEvt__W_Menu_Session_W_Settings_Button_K2Node_ComponentBoundEvent_3_Pressed__DelegateSignature();
	void CustomEvent(const class FString& InvitedBy, const struct FBlueprintSessionResult& InviteResult);
	void ExecuteUbergraph_W_Menu_Session(int32 EntryPoint);
	void Mec_Init();
	void Menu_Refresh(int32 Index_0);
	void OnCallback_39AAEA42492131422C8142B6113F0171(const TArray<struct FSteamSessionResult>& Results);
	void OnInitialized();
	void Refresh_Search();
	void Update_FriendList();
	void Update_Players_List();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Menu_Session_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Menu_Session_C")
	}
	static class UW_Menu_Session_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Menu_Session_C>();
	}
};
DUMPER7_ASSERTS_UW_Menu_Session_C;

}

