#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerDoorInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayerDoorInfo.W_PlayerDoorInfo_C
// 0x0030 (0x0300 - 0x02D0)
class UW_PlayerDoorInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Hidder;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             txt_index;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             txt_name;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             txt_ready;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_PlayerDoorInfo(int32 EntryPoint);
	void Set_Hidder(bool Hide);
	void Set_Image(class UObject* Image);
	void Set_Index(int32 Index_0);
	void Set_Name(const class FString& Name_0);
	void Set_Ready(bool Ready);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_PlayerDoorInfo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_PlayerDoorInfo_C")
	}
	static class UW_PlayerDoorInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PlayerDoorInfo_C>();
	}
};
DUMPER7_ASSERTS_UW_PlayerDoorInfo_C;

}

