#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Settings_Button

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Settings_Button.W_Settings_Button_C.ExecuteUbergraph_W_Settings_Button
// 0x0058 (0x0058 - 0x0000)
struct W_Settings_Button_C_ExecuteUbergraph_W_Settings_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Name;                           // 0x0008(0x0010)()
	struct FLinearColor                           K2Node_CustomEvent_Color;                          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Locked;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x002C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0040(0x0014)()
};
DUMPER7_ASSERTS_W_Settings_Button_C_ExecuteUbergraph_W_Settings_Button;

// Function W_Settings_Button.W_Settings_Button_C.Lock
// 0x0001 (0x0001 - 0x0000)
struct W_Settings_Button_C_Lock final
{
public:
	bool                                          Locked_0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Settings_Button_C_Lock;

// Function W_Settings_Button.W_Settings_Button_C.OnGenerateContentWidget
// 0x0028 (0x0028 - 0x0000)
struct W_Settings_Button_C_OnGenerateContentWidget final
{
public:
	class FName                                   Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Settings_List_Button_C*              CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0018(0x0010)()
};
DUMPER7_ASSERTS_W_Settings_Button_C_OnGenerateContentWidget;

// Function W_Settings_Button.W_Settings_Button_C.OnGenerateItemWidget
// 0x0028 (0x0028 - 0x0000)
struct W_Settings_Button_C_OnGenerateItemWidget final
{
public:
	class FName                                   Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Settings_List_Item_C*                CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0018(0x0010)()
};
DUMPER7_ASSERTS_W_Settings_Button_C_OnGenerateItemWidget;

// Function W_Settings_Button.W_Settings_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Settings_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Settings_Button_C_PreConstruct;

// Function W_Settings_Button.W_Settings_Button_C.Rename
// 0x0010 (0x0010 - 0x0000)
struct W_Settings_Button_C_Rename final
{
public:
	class FText                                   Param_Name_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_W_Settings_Button_C_Rename;

// Function W_Settings_Button.W_Settings_Button_C.Reset Color
// 0x0010 (0x0010 - 0x0000)
struct W_Settings_Button_C_Reset_Color final
{
public:
	struct FLinearColor                           Color_0;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Settings_Button_C_Reset_Color;

}

