#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Settings_Rule

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Str_gamerule_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Settings_Rule.W_Settings_Rule_C
// 0x0088 (0x0358 - 0x02D0)
class UW_Settings_Rule_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Settings_Selection_C*                Selection;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Value_C*                    Value;                                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   Rule;                                              // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FStr_gamerule                          Rule_Values;                                       // 0x02F0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   Last_Rule_Changed;                                 // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  GM_Ref;                                            // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_Settings_Rule_Selection_K2Node_ComponentBoundEvent_1_Value_Changed__DelegateSignature(int32 Index_0);
	void BndEvt__W_Settings_Rule_Value_K2Node_ComponentBoundEvent_0_Value_Changed__DelegateSignature(double Value_0);
	void ExecuteUbergraph_W_Settings_Rule(int32 EntryPoint);
	void Get_Other_Random_Task(class FName* Task);
	void Get_Valid_Tasks_Count(int32* Value_0);
	void On_Rule_Change(class FName Rule_0);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void Update_Values(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Settings_Rule_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Settings_Rule_C")
	}
	static class UW_Settings_Rule_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Settings_Rule_C>();
	}
};
DUMPER7_ASSERTS_UW_Settings_Rule_C;

}

