#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Settings_Text

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_Settings_Text.W_Settings_Text_C.ExecuteUbergraph_W_Settings_Text
// 0x0040 (0x0040 - 0x0000)
struct W_Settings_Text_C_ExecuteUbergraph_W_Settings_Text final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Name;                           // 0x0008(0x0010)()
	struct FLinearColor                           K2Node_CustomEvent_Color;                          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0028(0x0010)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Settings_Text_C_ExecuteUbergraph_W_Settings_Text;

// Function W_Settings_Text.W_Settings_Text_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Settings_Text_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Settings_Text_C_PreConstruct;

// Function W_Settings_Text.W_Settings_Text_C.Set Color
// 0x0010 (0x0010 - 0x0000)
struct W_Settings_Text_C_Set_Color final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Settings_Text_C_Set_Color;

// Function W_Settings_Text.W_Settings_Text_C.Set Name
// 0x0010 (0x0010 - 0x0000)
struct W_Settings_Text_C_Set_Name final
{
public:
	class FText                                   Param_Name_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_W_Settings_Text_C_Set_Name;

// Function W_Settings_Text.W_Settings_Text_C.Set Text
// 0x0010 (0x0010 - 0x0000)
struct W_Settings_Text_C_Set_Text final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_W_Settings_Text_C_Set_Text;

}

