#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Settings_Scroll

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Settings_Scroll.W_Settings_Scroll_C
// 0x00E8 (0x03B8 - 0x02D0)
class UW_Settings_Scroll_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             Container;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x02E0(0x0010)(Edit, BlueprintVisible)
	class UMainGI_C*                              GI_Ref;                                            // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            Reply;                                             // 0x02F8(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Deployed;                                          // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_W_Settings_Scroll(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Settings_Scroll_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Settings_Scroll_C")
	}
	static class UW_Settings_Scroll_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Settings_Scroll_C>();
	}
};
DUMPER7_ASSERTS_UW_Settings_Scroll_C;

}

