#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WeaponSetting

#include "Basic.hpp"

#include "Str_GunSettings_structs.hpp"


namespace SDK::Params
{

// Function W_WeaponSetting.W_WeaponSetting_C.ExecuteUbergraph_W_WeaponSetting
// 0x0480 (0x0480 - 0x0000)
struct W_WeaponSetting_C_ExecuteUbergraph_W_WeaponSetting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_GunSettings                       CallFunc_Get_Settings_Settings;                    // 0x0008(0x00D8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_GunSettings                       CallFunc_Get_Settings_Settings_1;                  // 0x00E0(0x00D8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_5;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_6;           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_DynamicCast_AsMec;                          // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0210(0x0010)()
	struct FStr_GunSettings                       CallFunc_Get_Settings_Settings_2;                  // 0x0220(0x00D8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_GunSettings                       K2Node_MakeStruct_Str_GunSettings;                 // 0x02F8(0x00D8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_FireRate_12_7E6B69BB47AECF4B0525769A77B08068_ImplicitCast; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_RecoilSpread_16_CCB05A7C43D09E4B4B5133A9AE7220A5_ImplicitCast; // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_RecoilInterp_22_8C41FA7F4F1C029D30395EBBD1DF6CC7_ImplicitCast; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_RecoilRecover_23_2471D7164DFA264B11FE339172E82533_ImplicitCast; // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_OffsetVertical_24_EDA328714D2E733309187ABB5E257120_ImplicitCast; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_OffsetHorizontal_25_9EACE2E241C29E93C0AD30A41F5A99C2_ImplicitCast; // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_RecoilElevation_33_0E775AE649928ACA3CE912B0120B3071_ImplicitCast; // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_RecoilReactivity_35_7976651840544A35791F4BA519A34C4F_ImplicitCast; // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_ShakeIntensity_36_599057CA4189C87F807AD9A92E348C64_ImplicitCast; // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_StandPrecision_37_7AADF0F54F6D65B02FDED8AB273B3444_ImplicitCast; // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_WalkPrecision_39_1D1FC90F4C7DB4AE9FF70DB6916C444E_ImplicitCast; // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_RunPrecision_45_9CA4315646461F6A47F3E8B2D4946362_ImplicitCast; // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_AirPrecision_46_20A410F54D89DB17A1B4BF9BC0C82B8C_ImplicitCast; // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_PrecisionReactivity_48_A8DE4C2A44A7E5078BB256B2C6B651B8_ImplicitCast; // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_ShotOscillation_49_738EDC8B4C8A97C77CB9DDAC81F1F8A2_ImplicitCast; // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_StandOscillation_55_AECB908C4C6B42C7A8BF58812F46B5A1_ImplicitCast; // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_WalkOscillation_56_8510D85A4B7F33BAFC54189B51EC003E_ImplicitCast; // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_RunOscillation_57_980FE4E4486181A571F52F9ED53156CB_ImplicitCast; // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_OscillationReactivity_58_E618657047A4A45FE2EFA0A70C7C01BB_ImplicitCast; // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_SprintRecover_59_4A001A844D95F81FBAB37BB3685A6624_ImplicitCast; // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_PrecisionRecover_47_DACBAFF74485E91B5579B89DC132A852_ImplicitCast; // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_Stun_69_E1DE4FD0421BC82FA96D51A622E4126A_ImplicitCast; // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_WeaponSetting_C_ExecuteUbergraph_W_WeaponSetting;

// Function W_WeaponSetting.W_WeaponSetting_C.Get Settings
// 0x01C0 (0x01C0 - 0x0000)
struct W_WeaponSetting_C_Get_Settings final
{
public:
	class UData_Gun_C*                            Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_GunSettings                       Settings;                                          // 0x0008(0x00D8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_GunSettings                       K2Node_MakeStruct_Str_GunSettings;                 // 0x00E8(0x00D8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_WeaponSetting_C_Get_Settings;

}

