#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponLoader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Str_ItemState_structs.hpp"
#include "Str_WeaponFoam_structs.hpp"
#include "Enum_Sectors_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_GenericMachine_State_structs.hpp"
#include "Enum_WeaponListCase_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeaponLoader.WeaponLoader_C
// 0x01C8 (0x0470 - 0x02A8)
class AWeaponLoader_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        MS_Bzz;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MS_Door;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_SoundPath1;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WeaponRecharge_Field;                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WeaponRecharge_Door;                            // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   S_SMG;                                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   S_Shotgun;                                         // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   S_Rifle;                                           // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WeaponRecharge;                                 // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CA_Button;                                         // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ContainerSlot;                                     // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   S_Shorty;                                          // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   S_Pistol;                                          // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_SoundPath;                                       // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   S_Revolver;                                        // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TL_Redlight_Take_5E267E774C34A56FEA6B7CBD4FB646AC; // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TL_Redlight_Place_5E267E774C34A56FEA6B7CBD4FB646AC; // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_Redlight__Direction_5E267E774C34A56FEA6B7CBD4FB646AC; // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_Redlight;                                       // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TL_Door_Curve_B434A6394F5899CC24B1E798B21563EA;    // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TL_Door_Bzz_B434A6394F5899CC24B1E798B21563EA;      // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_Door__Direction_B434A6394F5899CC24B1E798B21563EA; // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_Door;                                           // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Case_Open;                                         // 0x0398(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UData_Gun_C*                            Selected_Weapon_qsdsf;                             // 0x03A0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AItemSlot_C*                            Revoler;                                           // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	Enum_WeaponListCase                           Selected_Weapon;                                   // 0x03B0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASoundPath_C*                           SoundPath;                                         // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	Enum_Sectors                                  Sector;                                            // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<Enum_WeaponListCase, struct FStr_WeaponFoam> AssociatedFoam;                                // 0x03C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AWeaponCaseCode_C*                      PC_Ref;                                            // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AItemSlot_C*                            Pistol;                                            // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AItemSlot_C*                            Shorty;                                            // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Container_Type;                                    // 0x0430(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class AContainerSlot_C*                       Container;                                         // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	E_GenericMachine_State                        State;                                             // 0x0440(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_C*                              Button;                                            // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               M_Redlight;                                        // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AItemSlot_C*                            Rifle;                                             // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AItemSlot_C*                            SMG;                                               // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AItemSlot_C*                            Shotgun;                                           // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Apply_State();
	void BndEvt__WeaponCaseBox_Item_Slot_K2Node_ComponentBoundEvent_0_Take_Item__DelegateSignature();
	void BndEvt__WeaponLoader_Button_K2Node_ComponentBoundEvent_6_Button_Push__DelegateSignature(class AMec_C* Source);
	void BndEvt__WeaponLoader_Container_K2Node_ComponentBoundEvent_8_Place_Container__DelegateSignature();
	void BndEvt__WeaponLoader_Container_K2Node_ComponentBoundEvent_9_Take_Container__DelegateSignature();
	void BndEvt__WeaponLoader_Pistol_K2Node_ComponentBoundEvent_1_Place_Item__DelegateSignature();
	void BndEvt__WeaponLoader_Pistol_K2Node_ComponentBoundEvent_4_Take_Item__DelegateSignature();
	void BndEvt__WeaponLoader_Revoler_K2Node_ComponentBoundEvent_2_Place_Item__DelegateSignature();
	void BndEvt__WeaponLoader_Rifle_K2Node_ComponentBoundEvent_12_Take_Item__DelegateSignature();
	void BndEvt__WeaponLoader_Rifle_K2Node_ComponentBoundEvent_7_Place_Item__DelegateSignature();
	void BndEvt__WeaponLoader_Shorty_K2Node_ComponentBoundEvent_3_Place_Item__DelegateSignature();
	void BndEvt__WeaponLoader_Shorty_K2Node_ComponentBoundEvent_5_Take_Item__DelegateSignature();
	void BndEvt__WeaponLoader_Shotgun_K2Node_ComponentBoundEvent_11_Place_Item__DelegateSignature();
	void BndEvt__WeaponLoader_Shotgun_K2Node_ComponentBoundEvent_14_Take_Item__DelegateSignature();
	void BndEvt__WeaponLoader_SMG_K2Node_ComponentBoundEvent_10_Place_Item__DelegateSignature();
	void BndEvt__WeaponLoader_SMG_K2Node_ComponentBoundEvent_13_Take_Item__DelegateSignature();
	void Check_Combo();
	void Clear();
	void ExecuteUbergraph_WeaponLoader(int32 EntryPoint);
	void Lock_Machine();
	void OnRep_Case_Open();
	void OnRep_Container_Type();
	void OnRep_Selected_Weapon();
	void OnRep_State();
	void ReceiveBeginPlay();
	void Set_Redlight(bool TRUE_0);
	void Set_Weapon(Enum_WeaponListCase Weapon);
	void TL_Door__FinishedFunc();
	void TL_Door__UpdateFunc();
	void TL_Redlight__FinishedFunc();
	void TL_Redlight__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WeaponLoader_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeaponLoader_C")
	}
	static class AWeaponLoader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeaponLoader_C>();
	}
};
DUMPER7_ASSERTS_AWeaponLoader_C;

}

